       IDENTIFICATION DIVISION.
      *========================
       PROGRAM-ID. GNSPPFEN.
       AUTHOR. CST.
       DATE-WRITTEN.   18-MAR-1993 19:52:30
       ENVIRONMENT DIVISION.
      *=====================

       CONFIGURATION SECTION.
       SPECIAL-NAMES.
               DECIMAL-POINT IS COMMA.

       DATA DIVISION.
      *==============
       WORKING-STORAGE SECTION.
      *------------------------

      ******************************************************
      * Tuxedo definitions
      ******************************************************
        01 TX-RETURN-STATUS.
        COPY TXSTATUS.
      *
        01 PROGRAM-NAME PIC X(32).


       COPY GNSWGTSK.
       COPY GNSBRMNU.
       COPY GNSBRRPF.
       COPY GNSWGOSC.
       COPY GNSWCSCR.
       COPY GNSWV3CR.
       01  IDD-INIC              VALUE '##INI##' PIC X(07).
       COPY GNSWVIDD.
       01  IDD-FINA              VALUE '##FIN##' PIC X(07).
       COPY GNSWGTSC.

       01  CMN-VARI.
           03 CMN-SIND.
              05 CMN-I                PIC 9(02).
              05 CMN-K                PIC 9(02).
           03 CMN-IDX-CCMN    VALUE SPACES.
              05 CMN-VEC-CCMN OCCURS 10.
                 07 CMN-COD-CCMN      PIC X(03).
                 07 FILLER            PIC X(01).

       COPY GNSWCFIO.
       COPY GNSWVFIO.

       COPY GNSWG3CF.
       COPY GNSWITRL.
       COPY GNSBRMSG.
       COPY GNSBRTAB.
       COPY GNSWGRQA.
       COPY GNSWGUIB.
       COPY GNSWGELS.
       
       COPY GNSWGRQA REPLACING ==ADR-REQA== BY ==ADR-MSG-REQA==.
       COPY GNSWGRQA REPLACING ==ADR-REQA== BY ==ADR-MNU-REQA==.
       COPY GNSWGRQA REPLACING ==ADR-REQA== BY ==ADR-RPF-REQA==.
       COPY GNSWGRQA REPLACING ==ADR-REQA== BY ==ADR-TAB-REQA==.
      *
       01  RFN-VARI.
           03  RFN-COLA.
               05  RFN-TYPE VALUE 'GRET'            PIC X(04).
               05  RFN-TERM                         PIC X(04).
           03  RFN-LITM     COMP                    PIC S9(04).
           03  RFN-ITEM.
               05  RFN-PROG                         PIC X(08).
               05  RFN-FUNC.
                   07  RFN-SIST                     PIC X(03).
                   07  RFN-SISG                     PIC X(03).
                   07  RFN-NEMO                     PIC X(12).
                   07  RFN-CMND                     PIC X(03).
      *
       01  WSS-VARI.
           03 WSS-QIDD-LEN  VALUE +490          COMP PIC S9(04).
           03 WSS-COD-MSG0.
              05 WSS-COD-MSG1                         PIC X(01).
              05 WSS-COD-MSG2                         PIC X(08).
              05 WSS-COD-MSG3                         PIC X(03).

           03 WSS-AUX1.
              05 WSS-AUX1-1                          PIC X(02).
              05 WSS-AUX1-2                          PIC X(02).
              05 WSS-AUX1-3                          PIC X(02).
              05 WSS-AUX1-4                          PIC X(02).

           03 WSS-AUX2.
              05 WSS-AUX2-1                          PIC X(02).
              05 WSS-AUX2-2                          PIC X(02).
              05 WSS-AUX2-3                          PIC X(02).
              05 WSS-AUX2-4                          PIC X(02).


           03 WSS-TRANSACCIONAL                       PIC X(01).


           03 WSS-SCOD                                PIC X(02).
           03 WSS-SEFN                                PIC X(02).
           03 WSS-SXCT               COMP VALUE +3588 PIC S9(04).
           03 WSS-SXCT-RED         REDEFINES WSS-SXCT PIC X(02).
           03 WSS-QIDD.
              05 WSS-NIDD VALUE 'GIDD'    PIC X(04).
              05 WSS-TIDD                 PIC X(04).
           03 WSS-CCOD                   VALUE SPACES PIC X(05).
              88 WSS-CCOD-APCT           VALUE 'APCT'.
              88 WSS-CCOD-ABM0           VALUE 'ABM0'.
           03 WSS-DFLD.
              05 WSS-NTRN                             PIC X(04).
              05 WSS-CAXC.
                 07 WSS-SIST.
                    09 WSS-CSIS OCCURS 3              PIC X(01).
                 07 WSS-FILL                          PIC X(01).
                 07 WSS-SISG                          PIC X(03).
                 07 WSS-DISP                          PIC X(09).
           03 WSS-FUNC.
              05 WSS-FCHR OCCURS 11                   PIC X(01).
           03 WSS-AFUN.
              05 WSS-ACHR OCCURS 11                   PIC X(01).
           03 WSS-OPCI.
              05 WSS-COPC OCCURS 3                    PIC X(01).
           03 WSS-CMND.
              05 WSS-CCMD OCCURS 3                    PIC X(01).
           03 WSS-MAUT.
              05 WSS-FILA OCCURS 12.
                 07 WSS-COLU OCCURS 09.
                    09 WSS-AUTO                  PIC 9(02).
           03 WSS-MAUT-RED REDEFINES WSS-MAUT.
              05 WSS-ITM1                        PIC X(18).
              05 WSS-ITM2                        PIC X(18).
              05 WSS-ITM3                        PIC X(18).
              05 WSS-ITM4                        PIC X(18).
              05 WSS-ITM5                        PIC X(18).
              05 WSS-ITM6                        PIC X(18).
              05 WSS-ITM7                        PIC X(18).
              05 WSS-ITM8                        PIC X(18).
              05 WSS-ITM9                        PIC X(18).
              05 WSS-ITMA                        PIC X(18).
              05 WSS-ITMB                        PIC X(18).
              05 WSS-ITMC                        PIC X(18).
           03 WSS-STDO                   VALUE 1 PIC 9(02).
           03 WSS-ISIS                   VALUE 0 PIC 9(02).
           03 WSS-IOPC                   VALUE 0 PIC 9(02).
           03 WSS-ICMD                   VALUE 0 PIC 9(02).
           03 WSS-IMAX                   VALUE 0 PIC 9(02).
           03 WSS-IVAL                   VALUE 9 PIC 9(02).
              88 FUNCION-INVALIDA        VALUE 0.
              88 FUNCION-VALIDA          VALUE 1.
           03 WSS-SIND.
              05 WSS-I                           PIC 9(02).
              05 WSS-J                           PIC 9(02).
              05 WSS-K                           PIC 9(02).
              05 WSS-L                           PIC 9(02).
              05 WSS-M                           PIC 9(02).
           03 WSS-AUXI                           PIC X(03).
           03 UYP-PRTA.
              05 UYP-PROG                        PIC X(08).
              05 FILLER                VALUE '/' PIC X(01).
              05 UYP-CMND                        PIC X(03).
           03 WSS-MENS.
              05 WSS-MEN1                        PIC X(40).
              05 WSS-MEN2                        PIC X(79).
           03 WSS-COD-MENS.
              05 WSS-COD-TMSG.
                 07 WSS-COD-TMN1                 PIC X(03).
                 07 WSS-COD-TMN2                 PIC X(03).
                 07 WSS-COD-TMN3                 PIC X(01).
              05 WSS-COD-CMSG                    PIC X(05).
           03 WSS-ICMN                           PIC X(01).
              88 WSS-DESDE-CMN VALUE 'K'.
      *************************************************************
           03 WSS-IND-CMND             VALUE 0   PIC 9(01).
              88 WSS-EXISTE-COMANDO    VALUE 1.
              88 WSS-COMANDO-SINPRV    VALUE 2.
      *
           03 WSS-AUX-CMNP                       PIC X(08).
           03 WSS-AUX-PRMC                       PIC X(25).
           03 WSS-AUX-CMND                       PIC X(03).
           03 WSS-AUX-CRPF.
              05 WSS-TABL OCCURS 10.
                 07 WSS-COD-CMND                 PIC X(03).
                 07 WSS-COD-CCPP                 PIC X(03).
                 07 WSS-IND-STPP                 PIC X(01).
                 07 WSS-GLS-PRMT                 PIC X(25).
                 07 WSS-GLS-CONF                 PIC X(25).
                 07 WSS-GLS-UARC                 PIC X(12).
           03 WSS-IPRV                           PIC X(01).
              88 WSS-IPRV-TODO        VALUE '*'.
              88 WSS-IPRV-TODOS-MENUS VALUE '*', 'O', 'U', 'Q'.
              88 WSS-IPRV-TODOS-MAN   VALUE '*', 'U', 'M'.
              88 WSS-IPRV-TODOS-CON   VALUE '*', 'Q', 'C'.
           03 WSS-KNMO VALUE SPACES.
              05 WSS-KNMO-SIST                   PIC X(03).
              05 WSS-KNMO-SISG                   PIC X(03).
              05 WSS-KNMO-NEMO                   PIC X(12).
              05 WSS-KNMO-CMND                   PIC X(03).
              05 WSS-KNMO-PROG                   PIC X(08).
      * Variables que vienen de GNSPPMEN
       01  WSS-VOPC.
           03 WSS-STAT              VALUE 0        PIC 9(01).
              88 WSS-STAT-OKS       VALUE 0.
              88 WSS-STAT-WRN       VALUE 1.
              88 WSS-STAT-MAL       VALUE 2.
           03 WSS-SIND.
              05 I                                 PIC 9(02).
              05 J                                 PIC 9(02).
              05 K                  VALUE 0        PIC 9(02).
              05 L                  VALUE 0        PIC 9(02).
              05 IMIN               VALUE 0        PIC 9(02).
              05 IMAX               VALUE 0        PIC 9(02).
           03 WSS-RMNU                             PIC X(490).
           03 WSS-NSIS                             PIC X(003).
           03 WSS-MENU                             PIC X(003).
           03 WSS-NEMO                             PIC X(012).
           03 WSS-NEMO-RED REDEFINES WSS-NEMO.
              05 WSS-NEMO-CHR OCCURS 12            PIC X(01).
           03 WSS-IFRM                   VALUE '0' PIC X(01).
      *Variables para GNSSCRHDR
       01  HEA-VARI.
           03 HEA-SIMP              VALUE SPACES.
              05 HEA-GLS-SIMP       OCCURS 31      PIC X(01).
           03 HEA-DOBL              VALUE SPACES.
              05 HEA-GLS-DOBL       OCCURS 61      PIC X(01).
           03 HEA-FEC-DMSA.
              05 HEA-NUM-DMSA                      PIC 9(02).
              05 HEA-GLS-SLA1                      PIC X(01).
              05 HEA-NUM-MMSA                      PIC 9(02).
              05 HEA-GLS-SLA2                      PIC X(01).
              05 HEA-NUM-SMSA                      PIC 9(02).
              05 HEA-NUM-AMSA                      PIC 9(02).

       COPY GNSWGQUE.
       COPY GNSBRIDD.
       COPY GNSWGHOY.
       COPY GNSWGSYS.

       01  AUX-VARI.
           03 AUX-UARC.
              05 AUX-RPRG                               PIC X(08).
              05 AUX-RTRN                               PIC X(04).
           03 AUX-PRGM.
              05 AUX-PROG                               PIC X(08).
              05 AUX-NTRN                               PIC X(04).
       01  WSS-CMMA.
           03 WSS-RFUN                                  PIC X(300).
           03 WSS-NSXC                                  PIC X(003).
           03 WSS-GSXC                                  PIC X(003).
           03 FILLER                                    PIC X(011).
      *
       01  WSS-CHK-SIST                  VALUE ' '      PIC X(01).
           88 WSS-CHK-SIST-SI            VALUE 'S'.

       01  WSS-PPPV.
           03 WSS-PROV                                  PIC X(08).
           03 FILLER                                    PIC X(01).
           03 WSS-NTRV                                  PIC X(04).

       01  WSS-TSC-AUXI.
           03 FILLER                                    PIC X(05).
           03 WSS-CMA-OPCI                              PIC X(03).
           03 FILLER                                    PIC X(57).
           03 WSS-TSC-OPCI                              PIC X(03).

       01  WSS-USER                                     PIC X(08).
       01  WSS-MAPA-1                                   PIC X(07).
       01  WSS-MAPA-2                                   PIC X(07).

       01  WSS-OPID                                     PIC X(03).

       01  WSS-DISPLAY                                  PIC X(01).

       01  WSS-WI-CASO-ESPECIAL                         PIC X(2014).


       01  TRA-CHK-SIST                  VALUE ' ' PIC X(01).
           88 TRA-CHK-SIST-SI            VALUE 'S'.
           88 TRA-CHK-SIST-NO            VALUE 'N'.
           
       01  WSS-MENSAJE.
           03 WSS-MENS-INI.
              05 WSS-MENS-INI-STAT                      PIC X(01).
              05 WSS-MENS-INI-MENS                      PIC X(79).
              05 WSS-MENS-INI-INIC                      PIC X(01).
              05 WSS-MENS-INI-NTRN                      PIC X(04).
              05 WSS-MENS-INI-SIST                      PIC X(03).
              05 WSS-MENS-INI-SISG                      PIC X(03).
              05 WSS-MENS-INI-OPCI                      PIC X(03).
              05 WSS-MENS-INI-CMND                      PIC X(03).
              05 WSS-MENS-INI-BNCO                      PIC X(03).
              05 WSS-MENS-INI-MRCA                      PIC X(03).
              05 WSS-MENS-INI-CART                      PIC X(03).
              05 WSS-MENS-INI-LENG                      PIC X(02).
              05 WSS-MENS-INI-PAIS                      PIC X(02).
              05 WSS-MENS-INI-VRNT                      PIC X(01).
              05 WSS-MENS-INI-USER                      PIC X(12).
              05 WSS-MENS-INI-MODO                      PIC X(01).
              05 WSS-MENS-INI-CNAL                      PIC X(03).
              05 WSS-MENS-INI-TRAN                      PIC X(07).
              05 WSS-MENS-INI-FILL.
                 07 WSS-MENS-INI-TECL                   PIC X(03).
                 07 WSS-MENS-INI-COMMIT                 PIC X(01).
                 07 WSS-MENS-INI-FILLX                  PIC X(36).
                 07 WSS-MENS-INI-CIDD                   PIC X(12).
           03 WSS-MENS-CMMA-TOT.
              05 WSS-MENS-CMMA-TIP                      PIC X(1).
              05 WSS-MENS-CMMA                          PIC X(3999).
           03 WSS-MENS-WI                               PIC X(2014).
           03 WSS-MENS-FILL                             PIC X(800).

       01  SEND-STRING            PIC X(7000) VALUE SPACES.
       01  RECV-STRING            PIC X(7000) VALUE SPACES.


       PROCEDURE DIVISION.
      *===================
       MAIN SECTION.
       INI-MAIN.

           MOVE LENGTH OF LOGMSG TO LOGMSG-LEN.
           MOVE 'N'              TO WSS-TRANSACCIONAL.
           
           MOVE SPACES           TO WSS-WI-CASO-ESPECIAL.

           MOVE 7000 TO LEN.
           

           CALL "TPSVCSTART" USING TPSVCDEF-REC
                        TPTYPE-REC
                        RECV-STRING
                        TPSTATUS-REC.

           IF NOT TPOK
                MOVE "TPSVCSTART Failed" TO LOGMSG-TEXT
                PERFORM PRG-ABT.

           IF TPTRUNCATE
                MOVE "Data was truncated" TO LOGMSG-TEXT
                PERFORM PRG-ABT.


           MOVE RECV-STRING         TO WSS-MENSAJE.
           MOVE 0                   TO TSK-INFO-COMMIT.
           MOVE 'N'                 TO TRA-CHK-SIST.

           IF NOT ( WSS-MENS-INI-INIC = 'N' OR
                    WSS-MENS-INI-INIC = 'S' )
                MOVE '1'             TO WSS-MENS-INI-STAT
                MOVE "TPCALL Failed" TO WSS-MENS-INI-MENS
                PERFORM PRG-ABT.

           CALL "TPGETLEV" USING TPTRXLEV-REC TPSTATUS-REC. 
           IF NOT TPOK
                MOVE '1'               TO WSS-MENS-INI-STAT
                MOVE 'TPGETLEV Failed' TO WSS-MENS-INI-MENS
                PERFORM PRG-ABT
           ELSE
              IF TP-NOT-IN-TRAN
                MOVE '1'               TO WSS-MENS-INI-STAT
                MOVE 'TPGETLEV Failed' TO WSS-MENS-INI-MENS
                PERFORM PRG-ABT.

           CALL "TPSUSPEND" USING TPTRXDEF-REC TPSTATUS-REC.                           
           IF NOT TPOK
                MOVE '1'                TO WSS-MENS-INI-STAT
                MOVE 'TPSUSPEND Failed' TO WSS-MENS-INI-MENS
                PERFORM PRG-ABT.
           
           CALL "TPRESUME" USING TPTRXDEF-REC TPSTATUS-REC.             
           IF NOT TPOK
                MOVE '1'               TO WSS-MENS-INI-STAT
                MOVE 'TPRESUME Failed' TO WSS-MENS-INI-MENS
                PERFORM PRG-ABT.

           MOVE TRANID(1)           TO TSK-TRANID-1.
           MOVE TRANID(2)           TO TSK-TRANID-2.
           MOVE TRANID(3)           TO TSK-TRANID-3.
           MOVE TRANID(4)           TO TSK-TRANID-4.
           MOVE TRANID(5)           TO TSK-TRANID-5.
           MOVE TRANID(6)           TO TSK-TRANID-6.
           MOVE 'S'                 TO TSK-TERM-ORIGEN.
           MOVE SPACES              TO TSK-TERM-TUX.
           MOVE TSK-TRANID-ALF      TO TSK-TERM-TUX.
           MOVE TSK-TERM-TUX        TO TSK-TERM-TUX.                                 
           MOVE 'GET'               TO QUE-COM-SEND.                                                 
           MOVE TSK-TERM-TUX        TO QUE-NAM-SEND.      
           MOVE 1                   TO QUE-NUM-SEND.      
           MOVE 4                   TO QUE-LAR-SEND.      
           MOVE SPACES              TO QUE-TRX-SEND.      
           MOVE SPACES              TO QUE-DAT-SEND.                           
           PERFORM GNS-MSJ-QUE.
           IF QUE-STAT NOT = QUE-STAT-OKS
                MOVE '1'                  TO WSS-MENS-INI-STAT
                MOVE 'GET-QUE-TRA Failed' TO WSS-MENS-INI-MENS
                PERFORM PRG-ABT
           ELSE           
              MOVE QUE-DAT-RECV     TO QUE-ITEM           
              MOVE QUE-DATA         TO TSK-TERM-NUM-TUX-ALF
              MOVE TSK-TERM-NUM-TUX TO TSK-TERM-NUM
              MOVE TSK-TERM-ALF     TO EIBTASKN
              MOVE TSK-TERM-ALF     TO EIBTRMID.


           MOVE 'DEFAULT'           TO TSC-CIDD.           
           MOVE 'GIDD'              TO EIBTASKN-11.
           MOVE EIBTASKN            TO EIBTASKN-12.
           MOVE 'GET'               TO QUE-COM-SEND.
           MOVE EIBTASKN-1          TO QUE-NAM-SEND.
           MOVE 1                   TO QUE-NUM-SEND.
           MOVE +490                TO QUE-LAR-SEND.
           MOVE SPACES              TO QUE-TRX-SEND.
           MOVE SPACES              TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE
           IF QUE-STAT = QUE-STAT-OKS
              MOVE QUE-ITEM TO IDD-REGI                                                             
           ELSE                                                                             
              MOVE '1'                  TO WSS-MENS-INI-STAT
              MOVE 'GET-QUE-IDD Failed' TO WSS-MENS-INI-MENS
              PERFORM PRG-ABT.


           PERFORM GNS-GET-FIR.

       
           IF WSS-MENS-INI-INIC = 'N'
              MOVE WSS-MENS-INI-CIDD TO TSC-CIDD
              IF WSS-MENS-CMMA-TIP = '2'
                 MOVE WSS-MENS-CMMA      TO SCR-VARI
                 MOVE SPACES             TO SCR-IERR
                 MOVE SCR-PROG           TO SYS-PROG
                 MOVE SCR-NTRN           TO SYS-NTRN
                 MOVE WSS-MENS-CMMA      TO SYS-CMMA
              ELSE
                 MOVE WSS-MENS-CMMA      TO OSC-VARI
                 MOVE SPACES             TO OSC-IERR
                 MOVE OSC-PROG           TO SYS-PROG
                 MOVE OSC-NTRN           TO SYS-NTRN
                 MOVE WSS-MENS-CMMA      TO SYS-CMMA
           ELSE
              MOVE SPACES             TO WSS-MENS-CMMA-TIP
              PERFORM PROC-OPCION
              IF MSG-COD-MENS = 'CMD    NEXST'
                MOVE '1'                 TO WSS-MENS-INI-STAT
                MOVE "COMANDO NO EXISTE" TO WSS-MENS-INI-MENS
                PERFORM PRG-ABT.

           IF SYS-PROG NOT > SPACES
              GO TO SAL-MAIN.
              
           MOVE TSC-CIDD              TO WSS-MENS-INI-CIDD.
           PERFORM GNS-PUT-TDI.

           SET TPTRAN      TO TRUE.

           MOVE +3500    TO SYS-TCMA.

           IF WSS-MENS-CMMA-TIP = '2'
              MOVE SYS-CMMA           TO SCR-VARI
              MOVE SCR-NLIB           TO WSS-MAPA-1
           ELSE
              MOVE SYS-CMMA           TO OSC-VARI
              MOVE OSC-NLIB           TO WSS-MAPA-1.

           MOVE SPACES     TO SYS-SCR-NTRN.
           MOVE SYS-TCMA   TO LEN.
           MOVE "CARRAY"   TO REC-TYPE.
           MOVE SYS-PROG   TO SERVICE-NAME.
           CALL "TPCALL" USING TPSVCDEF-REC
                               TPTYPE-REC
                               SYS-CMMA
                               TPTYPE-REC
                               SYS-CMMA
                               TPSTATUS-REC.



           IF NOT TPOK
              MOVE '1'             TO WSS-MENS-INI-STAT
              MOVE "TPCALL Failed" TO WSS-MENS-INI-MENS
              PERFORM PRG-ABT
           ELSE
              MOVE '0'             TO WSS-MENS-INI-STAT
              MOVE SPACES          TO WSS-MENS-INI-MENS.

           MOVE SYS-CMMA   TO WSS-MENS-CMMA.
           IF WSS-MENS-CMMA-TIP = '2'
              MOVE WSS-MENS-CMMA      TO SCR-VARI
              MOVE SCR-IERR           TO WSS-MENS-INI-STAT
              MOVE SCR-NLIB           TO WSS-MAPA-2
           ELSE
              MOVE WSS-MENS-CMMA      TO OSC-VARI
              MOVE OSC-IERR           TO WSS-MENS-INI-STAT
              MOVE OSC-NLIB           TO WSS-MAPA-2.
              
           IF WSS-MENS-INI-STAT = 'S' OR WSS-MENS-INI-STAT = '1'
              MOVE '1' TO WSS-MENS-INI-STAT
           ELSE   
              MOVE '0' TO WSS-MENS-INI-STAT.
              

           IF WSS-MAPA-2 NOT = WSS-MAPA-1
              MOVE WSS-MAPA-2 TO WSS-MENS-INI-FILLX.

           PERFORM GNS-GET-TDI.

       SAL-MAIN.

           IF SYS-PROG = 'GNSPPMEN' OR SPACES
              MOVE 'F' TO WSS-MENS-INI-INIC
           ELSE
              MOVE 'N' TO WSS-MENS-INI-INIC.



           MOVE 0                  TO TSK-INFO-COMMIT.

           MOVE 'GET'              TO QUE-COM-SEND.
           MOVE TSK-TERM-TUX       TO QUE-NAM-SEND.
           MOVE 1                  TO QUE-NUM-SEND.
           MOVE 8                  TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX   TO QUE-TRX-SEND.
           MOVE SPACES             TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.
           IF QUE-STAT = QUE-STAT-OKS
              MOVE QUE-DATA           TO TSK-INFO-TRAN
              MOVE TSK-INFO-COMMIT    TO WSS-MENS-INI-COMMIT.

           PERFORM GNS-PUT-FIR.           
           
           MOVE 7000        TO LEN.
           MOVE WSS-MENSAJE TO SEND-STRING.
           MOVE "CARRAY"    TO REC-TYPE.
           SET TPSUCCESS    TO TRUE.
           CALL "TPRETURN" USING TPSVCRET-REC
                                 TPTYPE-REC
                                 SEND-STRING
                                 TPSTATUS-REC.

           IF NOT TPOK
                DISPLAY 'GNSPPLOP TPCALL TP-STATUS :' TP-STATUS.


           GOBACK.

       FIN-MAIN.
           EXIT.

       PRG-ABT SECTION.
       INI-PRG-ABT.

           CALL "TPABORT" USING TPTRXDEF-REC TPSTATUS-REC.
           IF NOT TPOK
                DISPLAY 'GNSPPFEN TPABORT TP-STATUS :' TP-STATUS.


           MOVE 7000        TO LEN.
           MOVE "CARRAY"    TO REC-TYPE.
           MOVE WSS-MENSAJE TO SEND-STRING.
           SET TPFAIL TO TRUE.
           CALL "TPRETURN" USING TPSVCRET-REC
                                 TPTYPE-REC
                                 SEND-STRING
                                 TPSTATUS-REC.

           GOBACK.

       FIN-PRG-ABT.
           EXIT.


       PROC-OPCION SECTION.
       INI-PROC-OPCION.

           MOVE SPACES              TO MSG-COD-MENS.
           MOVE SPACES              TO SYS-PROG

           MOVE  'S'                TO WSS-MENS-INI-INIC.
           MOVE  WSS-MENS-INI-SIST  TO WSS-SIST.
           MOVE  WSS-MENS-INI-SISG  TO WSS-SISG.
           MOVE  WSS-MENS-INI-OPCI  TO WSS-OPCI.
           MOVE  WSS-MENS-INI-CMND  TO WSS-CMND.

           IF WSS-SIST NOT > SPACES
               MOVE 'CODSISINEXST' TO MSG-COD-MENS
               MOVE SPACES              TO SCR-PROG
               MOVE SPACES              TO SYS-PROG
               MOVE SPACES              TO WSS-MENS-WI
               MOVE SPACES              TO WSS-MENS-CMMA
               MOVE '1'                 TO WSS-MENS-INI-STAT
               MOVE MSG-COD-MENS        TO WSS-MENS-INI-MENS
               GO TO FIN-PROC-OPCION.

           MOVE 'SIS'               TO MNU-COD-NEMO.
           MOVE FIO-GET-KEY         TO FIO-CMND.
           MOVE WSS-SIST            TO FIO-SIST.
           PERFORM GNS-FIO-MNU.
           IF NOT FIO-STAT-OKS
               MOVE 'CODSISINEXST' TO MSG-COD-MENS
               MOVE SPACES              TO SCR-PROG
               MOVE SPACES              TO SYS-PROG
               MOVE SPACES              TO WSS-MENS-WI
               MOVE SPACES              TO WSS-MENS-CMMA
               MOVE '1'                 TO WSS-MENS-INI-STAT
               MOVE MSG-COD-MENS        TO WSS-MENS-INI-MENS
               GO TO FIN-PROC-OPCION.

           MOVE WSS-SIST            TO TSC-SIST SCR-SIST.
           MOVE WSS-SISG            TO TSC-SISG.

           IF WSS-OPCI NOT > SPACES
               MOVE 'CODOPCINEXST' TO MSG-COD-MENS
               MOVE SPACES              TO SCR-PROG
               MOVE SPACES              TO SYS-PROG
               MOVE SPACES              TO WSS-MENS-WI
               MOVE SPACES              TO WSS-MENS-CMMA
               MOVE '1'                 TO WSS-MENS-INI-STAT
               MOVE MSG-COD-MENS        TO WSS-MENS-INI-MENS
               GO TO FIN-PROC-OPCION.


           MOVE WSS-SIST        TO FIO-SIST.
           MOVE WSS-OPCI        TO MNU-COD-OPCI IN MNU.
           MOVE FIO-GET-KEY     TO FIO-CMND.
           MOVE 'MNU-COD-OPCI'  TO FIO-AKEY.
           PERFORM GNS-FIO-MNU.
           IF NOT FIO-STAT-OKS
               MOVE 'CODOPCINEXST' TO MSG-COD-MENS
               MOVE SPACES              TO SCR-PROG
               MOVE SPACES              TO SYS-PROG
               MOVE SPACES              TO WSS-MENS-WI
               MOVE SPACES              TO WSS-MENS-CMMA
               MOVE '1'                 TO WSS-MENS-INI-STAT
               MOVE MSG-COD-MENS        TO WSS-MENS-INI-MENS
               GO TO FIN-PROC-OPCION.

           IF MNU-COD-SIST NOT > SPACES
               MOVE TSC-SIST TO MNU-COD-SIST.

           MOVE MNU-COD-SIST    TO TSC-SIST SCR-SIST.

           MOVE MNU-GLS-PROG    TO WSS-SIST.
           IF WSS-SIST NOT = 'GNS'
               MOVE MNU-COD-SIST TO WSS-SIST.

           MOVE SPACES       TO WSS-AUX-CRPF.

           IF MNU-COD-TFUN = 'MEN'
               MOVE 'CODMENINEXST' TO MSG-COD-MENS
               MOVE SPACES              TO SCR-PROG
               MOVE SPACES              TO SYS-PROG
               MOVE SPACES              TO WSS-MENS-WI
               MOVE SPACES              TO WSS-MENS-CMMA
               MOVE '1'                 TO WSS-MENS-INI-STAT
               MOVE MSG-COD-MENS        TO WSS-MENS-INI-MENS
               GO TO FIN-PROC-OPCION.

           IF MNU-GLS-PROG NOT > SPACES
               MOVE 'CODOPCINEXST' TO MSG-COD-MENS
               MOVE SPACES              TO SCR-PROG
               MOVE SPACES              TO SYS-PROG
               MOVE SPACES              TO WSS-MENS-WI
               MOVE SPACES              TO WSS-MENS-CMMA
               MOVE '1'                 TO WSS-MENS-INI-STAT
               MOVE MSG-COD-MENS        TO WSS-MENS-INI-MENS
              GO TO FIN-PROC-OPCION.

           PERFORM BUS-CRPF.
           PERFORM CRG-VSCR.

           MOVE '*'          TO TSC-IPRV
           MOVE TSC-IPRV     TO MNU-IND-IPRV.
           MOVE MNU-COD-SIST TO TSC-SIST SCR-SIST.
           MOVE MNU-COD-OPCI TO TSC-OPCI.
           MOVE MNU-COD-NEMO TO TSC-NEMO.
           MOVE MNU-GLS-TRAN TO TSC-NTRN.
           MOVE MNU-GLS-PROG TO TSC-PROG.
           MOVE MNU-GLS-LFRM TO TSC-NLIB.
           MOVE MNU-GLS-NFRM TO TSC-NMAP.
           MOVE MNU-GLS-LDOC TO TSC-LDOC.
           MOVE MNU-GLS-NDOC TO TSC-NDOC.
           MOVE MNU-COD-FRET TO TSC-FRET.
           MOVE MNU-IND-IPRV TO TSC-IPRV.
           MOVE MNU-COD-INST TO TSC-TINS.
           MOVE MNU-COD-TCTL TO TSC-TCTL.
           MOVE MNU-COD-TINF TO TSC-TINF.
           MOVE MNU-COD-TFUN TO TSC-TFUN.
           MOVE MNU-COD-CIFD TO TSC-CIDD.
           MOVE +250         TO TSC-TCMA.
           PERFORM GET-PROV.

           MOVE WSS-CMND     TO MNU-COD-CMND IN MNU.

           IF WSS-CMND NOT > SPACES
               MOVE 'CODCOMINEXST' TO MSG-COD-MENS
               MOVE SPACES              TO SCR-PROG
               MOVE SPACES              TO SYS-PROG
               MOVE SPACES              TO WSS-MENS-WI
               MOVE SPACES              TO WSS-MENS-CMMA
               MOVE '1'                 TO WSS-MENS-INI-STAT
               MOVE MSG-COD-MENS        TO WSS-MENS-INI-MENS
               GO TO FIN-PROC-OPCION.


           IF MNU-COD-CMND IN MNU > SPACES
              MOVE MNU-COD-CMND TO WSS-OPCI
              PERFORM BUS-CMND
              PERFORM PUT-DCMN
              PERFORM CAL-PROG.
           .
       FIN-PROC-OPCION.
           EXIT.

       GET-PROV SECTION.
       INI-GET-PROV.
           MOVE SPACES TO TSC-PROV.
           MOVE SPACES TO TSC-NTRV.
           IF TSC-TFUN NOT = 'PTC'
               GO TO FIN-GET-PROV.
           MOVE TSC-PROG     TO RPF-KEY-DPRO.
           MOVE 'C '         TO RPF-KEY-TRYC.
           MOVE SPACES       TO RPF-KEY-DARC.
      *
           MOVE TSC-PROG TO FIO-SIST.
           IF FIO-SIST NOT = 'GNS'
               MOVE TSC-SIST TO FIO-SIST.
      *
           MOVE FIO-GET-KEY TO FIO-CMND.
           PERFORM GNS-FIO-RPF.
           IF NOT FIO-STAT-OKS
               GO TO FIN-GET-PROV.
           MOVE RPF-GLS-ABRT IN RPF TO WSS-PPPV.
           MOVE WSS-PROV            TO TSC-PROV.
           MOVE WSS-NTRV            TO TSC-NTRV.
       FIN-GET-PROV.
           EXIT.

       BUS-CRPF SECTION.
       INI-BUS-CRPF.

           MOVE 0            TO WSS-IND-CMND.

           MOVE MNU-GLS-PROG TO RPF-KEY-DPRO.
           MOVE 'C '         TO RPF-KEY-TRYC.
           MOVE SPACES       TO RPF-KEY-DARC.
           MOVE WSS-SIST     TO FIO-SIST.
           MOVE FIO-GET-KEY  TO FIO-CMND.
           PERFORM GNS-FIO-RPF.
           IF NOT FIO-STAT-OKS
                MOVE 'CODOPCINEXST' TO MSG-COD-MENS
                GO TO FIN-BUS-CRPF.

           IF RPF-GLS-PRMT NOT > SPACES
               PERFORM BUS-PRMC
           ELSE
           IF RPF-GLS-PRMT NOT = 'NOMSG'
               MOVE RPF-GLS-PRMT TO WSS-AUX-PRMC
           ELSE
               MOVE SPACES TO WSS-AUX-PRMC.

           IF RPF-GLS-UARC NOT > SPACES
                MOVE 'GNSPPMEN' TO WSS-AUX-CMNP
           ELSE
                MOVE RPF-GLS-UARC TO WSS-AUX-CMNP.

           MOVE MNU-GLS-PROG TO RPF-KEY-DPRO.
           MOVE 'C0'         TO RPF-KEY-TRYC.
           MOVE WSS-SIST     TO FIO-SIST.
           MOVE FIO-GET-NLS  TO FIO-CMND.
           PERFORM GNS-FIO-RPF.
           IF NOT ( FIO-STAT-OKS AND
                    RPF-KEY-DPRO = MNU-GLS-PROG AND
                    RPF-KEY-TREG = 'C'              )
                 GO TO FIN-BUS-CRPF.

       INI-LEE-CRPF.


           IF MNU-COD-CMND IN MNU > SPACES AND
              MNU-COD-CMND = RPF-COD-CCMN
               MOVE MNU-COD-CMND TO WSS-AUX-CMND
               MOVE 1            TO WSS-IND-CMND.


           MOVE RPF-KEY-CORR TO I.
           ADD 1 I GIVING K.
           MOVE RPF-COD-CCMN TO WSS-COD-CMND( K )
           MOVE RPF-COD-CCPP TO WSS-COD-CCPP( K )
           MOVE RPF-IND-STPP TO WSS-IND-STPP( K )
           MOVE RPF-GLS-PRMT TO WSS-GLS-PRMT( K )
           MOVE RPF-GLS-CONF TO WSS-GLS-CONF( K )
           MOVE RPF-GLS-UARC TO WSS-GLS-UARC( K )

           MOVE FIO-GET-NXT TO FIO-CMND.
           MOVE WSS-SIST     TO FIO-SIST.
           PERFORM GNS-FIO-RPF.
           IF FIO-STAT-OKS AND
              RPF-KEY-DPRO = MNU-GLS-PROG AND
              RPF-KEY-TREG = 'C'
              GO TO INI-LEE-CRPF.

       FIN-LEE-CRPF.

           PERFORM BUS-GLOS VARYING I FROM 1 BY 1 UNTIL I > 10.


       FIN-BUS-CRPF.
           EXIT.

       CRG-VSCR SECTION.
       INI-CRG-VSCR.
           MOVE MNU-GLS-PROG TO TSC-PROG.
           MOVE WSS-AUX-CRPF TO TSC-CRPF.
           MOVE WSS-AUX-CMNP TO TSC-CMNP.
           MOVE WSS-AUX-PRMC TO TSC-PRMC.
           MOVE WSS-AUX-CMND TO TSC-CMND.
           MOVE MNU-COD-TFUN TO TSC-TFUN.
       FIN-CRG-VSCR.
           EXIT.

       BUS-PRMC SECTION.
       INI-BUS-PRMC.
           IF MNU-COD-TFUN = 'MEN'
               MOVE 'PRMMEN' TO MSG-COD-MENS
           ELSE
               MOVE 'PRMPGI' TO MSG-COD-MENS.
           MOVE 'GNS'    TO MSG-COD-SIST.
           PERFORM GET-MSG.
           MOVE MSG-GLS-DESC TO WSS-AUX-PRMC.
       FIN-BUS-PRMC.
           EXIT.

       BUS-GLOS SECTION.
       INI-BUS-GLOS.

           IF WSS-COD-CMND( I ) NOT > SPACES
               GO TO FIN-BUS-GLOS.

           IF WSS-GLS-PRMT( I ) NOT > SPACES
               MOVE SPACES TO WSS-COD-MENS
               IF WSS-GLS-UARC( I ) NOT > SPACES
                   MOVE 'GNS'             TO MSG-COD-SIST
                   MOVE 'FLD'             TO WSS-COD-TMN1
                   MOVE WSS-COD-CCPP( I ) TO WSS-COD-TMN2
                   MOVE WSS-COD-MENS      TO MSG-COD-MENS
                   PERFORM GET-MSG
                   MOVE MSG-GLS-DESC TO WSS-GLS-PRMT( I )
               ELSE
                   MOVE 'GNS'             TO MSG-COD-SIST
                   MOVE 'SUB'             TO WSS-COD-TMN1
                   MOVE WSS-COD-CCPP( I ) TO WSS-COD-TMN2
                   MOVE WSS-COD-MENS      TO MSG-COD-MENS
                   PERFORM GET-MSG
                   MOVE MSG-GLS-DESC TO WSS-GLS-PRMT( I )
           ELSE
               IF WSS-GLS-PRMT( I ) = 'NOMSG'
                   MOVE SPACES TO WSS-GLS-PRMT( I ).

           IF WSS-GLS-CONF( I ) NOT > SPACES
               MOVE SPACES TO WSS-COD-MENS
               MOVE 'GNS'             TO MSG-COD-SIST
               MOVE 'CNF'             TO WSS-COD-TMN1
               MOVE WSS-COD-CCPP( I ) TO WSS-COD-TMN2
               MOVE WSS-COD-MENS      TO MSG-COD-MENS
               PERFORM GET-MSG
               MOVE MSG-GLS-DESC TO WSS-GLS-CONF( I )
           ELSE
               IF WSS-GLS-CONF( I ) = 'NOMSG'
                  MOVE SPACES TO WSS-GLS-CONF( I ).

       FIN-BUS-GLOS.
           EXIT.

       CAL-PROG SECTION.
       INI-CAL-PROG.

           MOVE TSC-PROG TO WSS-SIST.
           IF WSS-SIST NOT = 'GNS'
               MOVE TSC-SIST TO WSS-SIST.

           IF TSC-UARC( TSC-I ) > SPACES
               MOVE TSC-UARC( TSC-I ) TO AUX-UARC
               MOVE TSC-PROG TO AUX-PROG
               MOVE TSC-NTRN TO AUX-NTRN
               MOVE AUX-PRGM TO TSC-UARC( TSC-I )
               MOVE AUX-RPRG TO TSC-PROG
               MOVE AUX-RTRN TO TSC-NTRN.

           MOVE 'P'          TO TSC-ICMN.
           MOVE SCR-INST-HCM TO TSC-INST.

           IF ( TSC-TINV = 'C' ) OR ( TSC-TINF NOT > SPACES )
               MOVE '1' TO WSS-MENS-CMMA-TIP
               PERFORM PRO-MOVE-SCR1
           ELSE
               MOVE '2' TO WSS-MENS-CMMA-TIP
               PERFORM PRO-MOVE-SCR2.

           MOVE WSS-MENS-INI-BNCO  TO SCR-HDR-BNCO.
           MOVE WSS-MENS-INI-MRCA  TO SCR-HDR-MRCA.
           MOVE WSS-MENS-INI-CART  TO SCR-HDR-CART.
           MOVE WSS-MENS-INI-LENG  TO SCR-HDR-LENG.
           MOVE WSS-MENS-INI-PAIS  TO SCR-HDR-PAIS.
           MOVE WSS-MENS-INI-VRNT  TO SCR-HDR-VRNT.
           MOVE WSS-MENS-INI-MODO  TO SCR-MODO.
           MOVE WSS-MENS-INI-CNAL  TO SCR-CNAL.

           MOVE WSS-QIDD           TO SCR-QIDD.
           MOVE +490               TO SCR-LIDD.

      *SI LAS VARIABLES DEL PROGRAMA VAN EN COMMAREA VERSION 1
           IF ( TSC-TINV = 'C' ) OR ( TSC-TINF NOT > SPACES )
               MOVE SPACES   TO OSC-IERR
               MOVE OSC-VARI TO SYS-CMMA
               MOVE +3500    TO SYS-TCMA
           ELSE
      *SI LAS VARIABLES DEL PROGRAMA VAN EN COMMAREA VERSION 2
           IF TSC-TINV = 'O'
               MOVE SPACES   TO SCR-IERR
               MOVE SCR-VARI TO SYS-CMMA
               MOVE SCR-TCMA TO SYS-TCMA
           ELSE
      *SE ASUME 'T' = SI LAS VARIABLES DEL PROGRAMA VAN EN TS
              MOVE SPACES   TO SYS-CMMA
              MOVE 0        TO SYS-TCMA.

           MOVE TSC-PROG TO SYS-PROG.
           MOVE TSC-NTRN TO SYS-NTRN.


       FIN-CAL-PROG.
           EXIT.

       PRO-MOVE-SCR1 SECTION.
       INI-PRO-MOVE-SCR1.

           MOVE +1110              TO OSC-TCMA.
           MOVE TSC-SIST           TO OSC-SIST.
           MOVE TSC-OPCI           TO OSC-FUNC.
           MOVE TSC-NEMO           TO OSC-NEMO.
           MOVE TSC-NTRV           TO OSC-NTRV.
           MOVE TSC-NTRN           TO OSC-NTRN.
           MOVE TSC-PROG           TO OSC-PROG.
           MOVE TSC-NLIB           TO OSC-NLIB.
           MOVE TSC-NMAP           TO OSC-NMAP.
           MOVE TSC-LDOC           TO OSC-LDOC.
           MOVE TSC-NDOC           TO OSC-NDOC.
           MOVE TSC-FRET           TO OSC-FRET.
           MOVE TSC-IPRV           TO OSC-IPRV.
           MOVE TSC-SISG           TO OSC-SISG.
           IF TSC-TINS > SPACES
               MOVE TSC-TINS       TO OSC-INST
           ELSE
               MOVE SCR-INST-HKY   TO OSC-INST.
           MOVE TSC-TFUN           TO OSC-TFUN.
           MOVE TSC-CMNP           TO OSC-CMNP.
           MOVE TSC-FFLD           TO OSC-FFLD.
           MOVE TSC-I              TO OSC-I.
           MOVE TSC-CCMN( TSC-I )  TO OSC-CMND.
           MOVE TSC-PRMC           TO OSC-PRMC.
           MOVE TSC-CCPP( TSC-I )  TO OSC-CCPP.
           MOVE TSC-STPP( TSC-I )  TO OSC-STPP.
           MOVE 1 TO FRM-IFLD.
       LUP-PRO-MOVE-SCR1.
           MOVE TSC-CCMN(FRM-IFLD) TO OSC-COD-CCMN(FRM-IFLD).
           MOVE TSC-CCPP(FRM-IFLD) TO OSC-COD-CCPP(FRM-IFLD).
           MOVE TSC-STPP(FRM-IFLD) TO OSC-IND-STPP(FRM-IFLD).
           MOVE TSC-PRMT(FRM-IFLD) TO OSC-GLS-PRMT(FRM-IFLD).
           MOVE TSC-CONF(FRM-IFLD) TO OSC-GLS-CONF(FRM-IFLD).
           MOVE TSC-UARC(FRM-IFLD) TO OSC-GLS-UARC(FRM-IFLD).
           ADD 1 TO FRM-IFLD.
           IF FRM-IFLD NOT > 10
               GO TO LUP-PRO-MOVE-SCR1.

           MOVE WSS-MENS-INI-USER  TO SCR-USER.
           MOVE TSC-OTRN           TO OSC-OTRN.
           MOVE TSC-PROV           TO OSC-PROV.
           MOVE 'C'                TO OSC-ICMN.

       FIN-PRO-MOVE-SCR1.
           EXIT.

       PRO-MOVE-SCR2 SECTION.
       INI-PRO-MOVE-SCR2.

           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MEC'
              MOVE 'COL' TO TSC-SIST
              MOVE 'COL' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MET'
              MOVE 'TAB' TO TSC-SIST
              MOVE 'TAB' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'ME2'
              MOVE 'MC2' TO TSC-SIST
              MOVE 'MC2' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MED'
              MOVE 'DEU' TO TSC-SIST
              MOVE 'DEU' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MES'
              MOVE 'SGC' TO TSC-SIST
              MOVE 'SGC' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MEL'
              MOVE 'LDC' TO TSC-SIST
              MOVE 'LDC' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MEB'
              MOVE 'BGL' TO TSC-SIST
              MOVE 'BGL' TO TSC-SISG.

           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MEX'
              MOVE 'DAP' TO TSC-SIST
              MOVE 'DAP' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MEG'
              MOVE 'LCM' TO TSC-SIST
              MOVE 'LCM' TO TSC-SISG.

           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'MEF'
              MOVE 'FCM' TO TSC-SIST
              MOVE 'FCM' TO TSC-SISG.

           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPC'
              MOVE 'COL' TO TSC-SIST
              MOVE 'COL' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPT'
              MOVE 'TAB' TO TSC-SIST
              MOVE 'TAB' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PP2'
              MOVE 'MC2' TO TSC-SIST
              MOVE 'MC2' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPD'
              MOVE 'DEU' TO TSC-SIST
              MOVE 'DEU' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPS'
              MOVE 'SGC' TO TSC-SIST
              MOVE 'SGC' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPL'
              MOVE 'LDC' TO TSC-SIST
              MOVE 'LDC' TO TSC-SISG.


           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPB'
              MOVE 'BGL' TO TSC-SIST
              MOVE 'BGL' TO TSC-SISG.

           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPX'
              MOVE 'DAP' TO TSC-SIST
              MOVE 'DAP' TO TSC-SISG.

           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPG'
              MOVE 'LCM' TO TSC-SIST
              MOVE 'LCM' TO TSC-SISG.

           IF WSS-SIST = 'GNS' AND MNU-COD-OPCI IN MNU = 'PPF'
              MOVE 'FCM' TO TSC-SIST
              MOVE 'FCM' TO TSC-SISG.


           MOVE +250               TO SCR-TCMA.
           MOVE TSC-SIST           TO SCR-SIST.
           MOVE TSC-SISG           TO SCR-SISG.
           MOVE TSC-NTRN           TO SCR-NTRN.
           MOVE TSC-PROG           TO SCR-PROG.
           MOVE TSC-NTRV           TO SCR-NTRV.
           MOVE TSC-PROV           TO SCR-PROV.
           MOVE TSC-NLIB           TO SCR-NLIB.
           MOVE TSC-NMAP           TO SCR-NMAP.
           IF TSC-TINS > SPACES
               MOVE TSC-TINS       TO SCR-INST
           ELSE
               MOVE SCR-INST-HKY   TO SCR-INST.
           MOVE TSC-CMNP           TO SCR-CMNP.
           MOVE TSC-CCMN( TSC-I )  TO SCR-CMND.
           MOVE TSC-CCPP( TSC-I )  TO SCR-CCPP.
           MOVE TSC-STPP( TSC-I )  TO SCR-STPP.
           MOVE TSC-PRMT( TSC-I )  TO SCR-PRMT.
           MOVE TSC-CONF( TSC-I )  TO SCR-CONF.

           MOVE WSS-MENS-INI-USER  TO SCR-USER.
           MOVE TSC-OTRN           TO SCR-OTRN.
           MOVE 'C'                TO SCR-ICMN.
           MOVE TSC-NEMO           TO SCR-NEMO.
           MOVE TSC-LDOC           TO SCR-LDOC.
           MOVE TSC-NDOC           TO SCR-NDOC.
           MOVE TSC-FRET           TO SCR-FRET.
           MOVE TSC-IPRV           TO SCR-IPRV.
           MOVE TSC-FFLD           TO SCR-FFLD.

       FIN-PRO-MOVE-SCR2.
           EXIT.





       BUS-CMND SECTION.
       INI-BUS-CMND.
           MOVE 'CMD    NEXST' TO MSG-COD-MENS.
           MOVE 1 TO CMN-I.
           SET TSC-ITBL TO 1.
           SEARCH TSC-TABL VARYING CMN-I
                  WHEN TSC-CCMN( TSC-ITBL ) = WSS-OPCI
                         GO TO SET-BUS-CMND.
           GO TO FIN-BUS-CMND.
       SET-BUS-CMND.
           MOVE SPACES TO MSG-COD-MENS.
       FIN-BUS-CMND.
           EXIT.

       PUT-DCMN SECTION.
       INI-PUT-DCMN.

           MOVE CMN-I             TO TSC-I.
           MOVE TSC-CCMN( TSC-I ) TO TSC-CMND.
           MOVE SPACES            TO CMN-IDX-CCMN.
           MOVE TSC-CCMN( TSC-I ) TO CMN-COD-CCMN( TSC-I ).
           MOVE CMN-IDX-CCMN      TO TRL-COD-CMND.
           MOVE SPACES            TO TRL-GLS-PRMT TRL-COD-CACC.

           IF TSC-SIST = 'GNS' AND
              TSC-SISG > SPACES
                MOVE TSC-SISG TO MSG-COD-SIST
           ELSE
                MOVE TSC-SIST TO MSG-COD-SIST.

           MOVE '%'          TO WSS-COD-MSG1.
           MOVE TSC-PROG     TO WSS-COD-MSG2.
           MOVE TSC-CMND     TO WSS-COD-MSG3.
           MOVE WSS-COD-MSG0 TO MSG-COD-MENS.
           PERFORM GET-MSG.
           IF FIO-STAT-OKS AND MSG-IND-VIGE = 'S'
               MOVE MSG-GLS-DESC TO WSS-MEN1
               MOVE MSG-GLS-MENS TO WSS-MEN2
               MOVE WSS-MENS TO TRL-GLS-TERM
           ELSE
               MOVE 'GNS'                 TO MSG-COD-SIST
               MOVE SPACES                TO WSS-COD-MENS
               MOVE 'PFSPGI'              TO WSS-COD-TMSG
               MOVE TSC-STPP( TSC-I ) TO WSS-COD-TMN3
               MOVE WSS-COD-MENS          TO MSG-COD-MENS
               PERFORM GET-MSG
               MOVE MSG-GLS-DESC TO WSS-MEN1
               MOVE MSG-GLS-MENS TO WSS-MEN2
               MOVE WSS-MENS TO TRL-GLS-TERM.

           MOVE MSG-GLS-DESC TO TRL-GLS-MENS.

       CON-PUT-DCMN.
           MOVE FRM-CPSF-AEY TO TRL-COD-CACC-ATR.
           MOVE -1           TO TRL-COD-CACC-LEN.
       FIN-PUT-DCMN.
           EXIT.

       GNS-PUT-TDI SECTION.
       INI-GNS-PUT-TDI.

           MOVE TSK-TERM-ALF TO QUE-TERM.
           MOVE 'TSI'        TO QUE-TYPE.


           MOVE 1            TO QUE-NITM.
           MOVE +2014        TO QUE-LITM

           MOVE 'MOD'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE QUE-NITM         TO QUE-NUM-SEND.
           MOVE QUE-LITM         TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE WSS-MENS-WI      TO QUE-DATA

           MOVE QUE-DATA         TO WSS-MENS-WI.

           MOVE QUE-ITEM         TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.
           IF QUE-STAT = QUE-STAT-OKS
              GO TO FIN-GNS-PUT-TDI.

           MOVE 'PUT'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE ZEROES           TO QUE-NUM-SEND.
           MOVE QUE-LITM         TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE WSS-MENS-WI      TO QUE-DATA
           MOVE QUE-ITEM         TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.

       FIN-GNS-PUT-TDI.
            EXIT.


       GNS-GET-TDI SECTION.
       INI-GNS-GET-TDI.

           MOVE TSK-TERM-ALF TO QUE-TERM.
           MOVE 'TSI'        TO QUE-TYPE.
           MOVE 1            TO QUE-NITM.
           MOVE +2014        TO QUE-LITM.

           MOVE 'GET'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE QUE-NITM         TO QUE-NUM-SEND.
           MOVE QUE-LITM         TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE SPACES           TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.
           IF QUE-STAT NOT = QUE-STAT-OKS
              GO TO FIN-GNS-GET-TDI.

           MOVE QUE-DATA         TO WSS-MENS-WI.

           MOVE 'DEL'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE ZEROES           TO QUE-NUM-SEND.
           MOVE ZEROES           TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE SPACES           TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.


       FIN-GNS-GET-TDI.
            EXIT.


       GNS-DEL-TDI SECTION.
       INI-GNS-DEL-TDI.

           MOVE TSK-TERM-ALF TO QUE-TERM.
           MOVE 'TSI'        TO QUE-TYPE.
           MOVE 1            TO QUE-NITM.
           MOVE +2014        TO QUE-LITM.


           MOVE 'DEL'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE ZEROES           TO QUE-NUM-SEND.
           MOVE ZEROES           TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE SPACES           TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.

       FIN-GNS-DEL-TDI.
            EXIT.


       GNS-PUT-FIR SECTION.
       INI-GNS-PUT-FIR.

           MOVE TSK-TERM-ALF TO QUE-TERM.
           MOVE 'FIR'        TO QUE-TYPE.


           MOVE 1            TO QUE-NITM.
           MOVE +7000        TO QUE-LITM

           MOVE 'MOD'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE QUE-NITM         TO QUE-NUM-SEND.
           MOVE QUE-LITM         TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE WSS-MENSAJE      TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.
           IF QUE-STAT = QUE-STAT-OKS
              GO TO FIN-GNS-PUT-FIR.

           DISPLAY 'GNSPPFEN PUT FIR :' WSS-MENSAJE.

           MOVE 'PUT'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE ZEROES           TO QUE-NUM-SEND.
           MOVE QUE-LITM         TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE WSS-MENSAJE      TO QUE-DAT-SEND.           
           PERFORM GNS-MSJ-QUE.

       FIN-GNS-PUT-FIR.
            EXIT.


       GNS-GET-FIR SECTION.
       INI-GNS-GET-FIR.

           MOVE TSK-TERM-ALF TO QUE-TERM.
           MOVE 'FIR'        TO QUE-TYPE.
           MOVE 1            TO QUE-NITM.
           MOVE +7000        TO QUE-LITM.

           MOVE 'GET'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE QUE-NITM         TO QUE-NUM-SEND.
           MOVE QUE-LITM         TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE SPACES           TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.
           IF QUE-STAT NOT = QUE-STAT-OKS
              GO TO FIN-GNS-GET-FIR.

           MOVE QUE-DAT-RECV     TO WSS-MENSAJE.
           DISPLAY 'GNSPPFEN GET FIR :' WSS-MENSAJE.

           MOVE TSK-TERM-ALF TO QUE-TERM.
           MOVE 'FIR'        TO QUE-TYPE.
           MOVE 1            TO QUE-NITM.
           MOVE +7000        TO QUE-LITM.


           MOVE 'DEL'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE ZEROES           TO QUE-NUM-SEND.
           MOVE ZEROES           TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE SPACES           TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.
           

       FIN-GNS-GET-FIR.
            EXIT.


       GNS-DEL-FIR SECTION.
       INI-GNS-DEL-FIR.

           MOVE TSK-TERM-ALF TO QUE-TERM.
           MOVE 'FIR'        TO QUE-TYPE.
           MOVE 1            TO QUE-NITM.
           MOVE +7000       TO QUE-LITM.


           MOVE 'DEL'            TO QUE-COM-SEND.
           MOVE QUE-COLA         TO QUE-NAM-SEND.
           MOVE ZEROES           TO QUE-NUM-SEND.
           MOVE ZEROES           TO QUE-LAR-SEND.
           MOVE TSK-TERM-NUM-TUX TO QUE-TRX-SEND.
           MOVE SPACES           TO QUE-DAT-SEND.
           PERFORM GNS-MSJ-QUE.

       FIN-GNS-DEL-FIR.
            EXIT.




       COPY GNSBGDTC.
       COPY GNSBFMNU.
       COPY GNSBFRPF.
       COPY GNSBGMSG.
       COPY GNSBFMSG.
       COPY GNSBFTAB.
       COPY GNSBGHOY.
       COPY GNSBGSYS.
       COPY GNSBGQUE.
       COPY GNSBGTSK.
