      *    Element List                                                 00000010
       01  ADR-ELLS.                                                    00000020
      *    Elemento 1                                                   00000030
           03 ADR-ELM1                                  PIC X(05).      00000040
      *    Codigo de Seguridad                                          00000050
           03 ADR-CSEG                                  PIC X(01).      00000060
      *    Fin de Element List                                          00000070
           03 FILLER                    VALUE SPACES    PIC X(05).      00000080
