      * User Information Block                                          00000010
       01  ADR-UIFB.                                                    00000020
      *                                                                 00000030
      *    Programa                                                     00000040
           03 ADR-PROG                                  PIC X(08).      00000050
      *                                                                 00000060
           03 FILLER                                    PIC X(24).      00000070
