       GNS-BUS-VCA SECTION.                                             
       INI-GNS-BUS-VCA.                                                 
           MOVE DFHCOMMAREA(1:EIBCALEN) TO SCR-VARI.   
       FIN-GNS-BUS-VCA.                                                 
           EXIT.                                                        
