      *GNSLGFIO CB2                                                     00000010
       01  FIO-BUF0.                                                    00000020
           02 FILLER                 PIC X(1536).                       00000030
