       IDENTIFICATION DIVISION.
      *========================
       PROGRAM-ID.    GNSPPIDM.
       AUTHOR.        BEE (AFRI)
       DATE-WRITTEN.  16-ABR-2019
      *-----------------------------------------------------------------
      * BUSCA INFORMACION DE MODULO A EJECUTAR SEGUN PARAMETRIA
      *-----------------------------------------------------------------

       ENVIRONMENT DIVISION.
      *=====================
       CONFIGURATION SECTION.
      *----------------------
       SPECIAL-NAMES.
               DECIMAL-POINT IS COMMA.

       DATA DIVISION.
      *==============
       WORKING-STORAGE SECTION.
      *------------------------
       COPY GNSWCSCR.
       COPY GNSWVSCR.
       COPY GNSWGRQA.
       COPY GNSWGUIB.
       COPY GNSWGCPT.
       COPY GNSWGELS.
       COPY GNSWCFIO.
       COPY GNSWVFIO.
       COPY GNSWVIDD.
      *COPY GNSWGFRM.
       COPY GNSWG3CF.
       01 FRM-NTRN                PIC X(04).                        
       01 FRM-PROG                PIC X(08).                        
       01 FRM-PROG-RED REDEFINES FRM-PROG                           
                       OCCURS 8   PIC X(01).                        
       COPY GNSWGSYS.
       COPY GNSWGTSK.
       COPY GNSWGFEC.
       COPY GNSWGHOY.
       COPY GNSWGPES.
       COPY GNSWGQUE.
       COPY GNSBRMSG.
       COPY GNSBRTAB.
       COPY GNSBRMSC.
       COPY GNSWGRQA REPLACING ==ADR-REQA== BY ==ADR-MSG-REQA==.
       COPY GNSWGRQA REPLACING ==ADR-REQA== BY ==ADR-TAB-REQA==.
       COPY GNSWGRQA REPLACING ==ADR-REQA== BY ==ADR-MSC-REQA==.

       COPY GNSWGCIC.
       COPY GNSWCVRF.
       COPY GNSWVVRF.
       COPY GNSWGIDM.

       01 WCC-VARI.
           03 WCC-S               VALUE 'S'          PIC X(01).
           03 WCC-GNSPPIDM        VALUE 'GNSPPIDM'   PIC X(08).
           03 WCC-KEYNOEXI        VALUE 'KEYNOEXI'   PIC X(08).
           03 WCC-IDM             VALUE 'IDM'        PIC X(03).

      *INI-MFC TUXEDO ORACLE
      * LINKAGE SECTION.
       COPY GNSWHLKG.
      *FIN-MFC TUXEDO ORACLE
      *----------------
       01  DFHCOMMAREA.
           03 FILLER                          PIC X(3000).
       COPY GNSLGFIO.

       PROCEDURE DIVISION.
      *===================
       MAIN SECTION.
       INI-MAIN.
      *INI-MFC TUXEDO ORACLE
            PERFORM GNS-PRO-LIMPIAR-VARIABLES.
      *FIN-MFC TUXEDO ORACLE
       COPY GNSBHTUX.
       COPY GNSBGEDB.
           MOVE DFHCOMMAREA(1:EIBCALEN) TO IDM-CMMA.
           DISPLAY 'EIBCALEN : ' EIBCALEN.
           DISPLAY 'DFHCOMMAREA : ' DFHCOMMAREA(1:EIBCALEN).
           MOVE WCC-GNSPPIDM TO FIO-PROG.
           MOVE IDM-QIDD TO SCR-QIDD.
           MOVE IDM-LIDD TO SCR-LIDD.
           MOVE IDM-SIST  TO SCR-SIST.
           DISPLAY 'PPIDM 001'.
           PERFORM GNS-BUS-IDD.
           DISPLAY 'PPIDM 002'.
           PERFORM GNS-ERR-QUE.
           DISPLAY 'PPIDM 003'.

      *RGD-INI
           PERFORM GET-TSK-TERM.
           DISPLAY 'PPIDM 004'.
      *RGD-FIN
           PERFORM BUS-SEDE-RESP.
           DISPLAY 'PPIDM 005'.
           MOVE IDM-CMMA TO DFHCOMMAREA(1:EIBCALEN).
        FIN-MAIN.
      *INI-PENTA TUXEDO ORACLE
      *     EXEC CICS RETURN END-EXEC.
           MOVE +0 TO EIBRESP.
       COPY GNSBHTER.
       COPY GNSBGGBK.
           EXIT.
      *FIN-PENTA TUXEDO ORACLE
      *----------------------------------------------------------------
       BUS-SEDE-RESP SECTION.
       INI-BUS-SEDE-RESP.

           MOVE SPACES TO IDM-SALI.

           MOVE IDM-SIST TO FIO-SIST TAB-COD-SIST.
           MOVE WCC-IDM TO TAB-COD-TTAB IN TAB.
           MOVE IDM-KEY-TAB TO TAB-COD-CTAB IN TAB.
           MOVE FIO-GET-KEY TO FIO-CMND.
           DISPLAY 'PPIDM 0041:' TAB '>'.
           PERFORM GNS-FIO-TAB.
           DISPLAY 'PPIDM 0042'.
           IF NOT FIO-STAT-OKS
               MOVE WCC-S TO IDM-IND-ERROR
               MOVE WCC-KEYNOEXI TO IDM-COD-ERROR
               MOVE WCC-KEYNOEXI TO MSG-COD-MENS
               MOVE 'TAB' TO MSG-COD-SIST
               PERFORM GET-MSG
               MOVE MSG-GLS-DESC TO IDM-GLS-ERROR
               GO TO FIN-BUS-SEDE-RESP.

           MOVE TAB-GLS-DATA IN TAB(1:8) TO IDM-SEDE.
           MOVE TAB-GLS-DESC IN TAB TO IDM-FUNC.
           MOVE TAB-IND-VIGE IN TAB TO IDM-VIGE.


       FIN-BUS-SEDE-RESP.
           EXIT.
      *----------------------------------------------------------------
       COPY GNSBFMSG.
       COPY GNSBFTAB.
       COPY GNSBFMSC.
       COPY GNSBGMSG.
       COPY GNSBGFEC.
       COPY GNSBPFEC.
       COPY GNSBGHOY.
       COPY GNSBGDTC.
       COPY GNSBIABT.
       COPY GNSBGFRM.
       COPY GNSBGSYS.
       COPY GNSBGPES.
       COPY GNSBGCPT.
       COPY GNSBPVRF.
       COPY GNSBBIDD.
       COPY GNSBGQUE.
       COPY GNSBGTSK.
      *INI-MFC TUXEDO ORACLE
       COPY GNSZPIDM.
      *FIN-MFC TUXEDO ORACLE
