      * Constantes para validacion numerica                             
       01  NUM-CTTS.                                                    
           03 NUM-ZERO-N                        VALUE 1 PIC 9(01).      
           03 NUM-ZERO-S                        VALUE 0 PIC 9(01).      
           03 NUM-SGNO-N                        VALUE 0 PIC 9(01).      
           03 NUM-SGNO-S                        VALUE 1 PIC 9(01).      
