      *                                                                 00000010
      * VARIABLES GENERICAS CVT                                         00000020
      *                                                                 00000030
       01  WSS-CVT-ITEM        VALUE SPACES      PIC X(125).            00000040
