       GNS-PRO-LIMPIAR-VARIABLES SECTION.
       INI-GNS-PRO-LIMPIAR-VARIABLES.

           MOVE 0 TO SCR-TCMA IN SCR-VARI.
           MOVE SPACES TO SCR-SIST IN SCR-VARI.
           MOVE SPACES TO SCR-SISG IN SCR-VARI.
           MOVE SPACES TO SCR-NTRN IN SCR-VARI.
           MOVE SPACES TO SCR-PROG IN SCR-VARI.
           MOVE SPACES TO SCR-NTRV IN SCR-VARI.
           MOVE SPACES TO SCR-PROV IN SCR-VARI.
           MOVE SPACES TO SCR-NLIB IN SCR-VARI.
           MOVE SPACES TO SCR-NMAP IN SCR-VARI.
           MOVE SPACES TO SCR-RFBY IN SCR-VARI.
           MOVE SPACES TO SCR-STAT IN SCR-VARI.
           MOVE SPACES TO SCR-INST IN SCR-VARI.
           MOVE SPACES TO SCR-ACTU IN SCR-VARI.
           MOVE SPACES TO SCR-CMNP IN SCR-VARI.
           MOVE LOW-VALUE TO SCR-CRPF IN SCR-VARI.
           MOVE SPACES TO SCR-CMND IN SCR-CRPF.
           MOVE SPACES TO SCR-CCPP IN SCR-CRPF.
           MOVE SPACES TO SCR-STPP IN SCR-CRPF.
           MOVE SPACES TO SCR-PRMT IN SCR-CRPF.
           MOVE SPACES TO SCR-CONF IN SCR-CRPF.
           MOVE SPACES TO SCR-USER IN SCR-VARI.
           MOVE SPACES TO SCR-OTRN IN SCR-VARI.
           MOVE SPACES TO SCR-UMOD IN SCR-VARI.
           MOVE SPACES TO SCR-ICMN IN SCR-VARI.
           MOVE SPACES TO SCR-QIDD IN SCR-VARI.
           MOVE 0 TO SCR-LIDD IN SCR-VARI.
           MOVE SPACES TO SCR-NEMO IN SCR-VARI.
           MOVE SPACES TO SCR-LDOC IN SCR-VARI.
           MOVE LOW-VALUE TO SCR-NDOC IN SCR-VARI.
           MOVE SPACES TO SCR-HDR-BNCO IN SCR-NDOC.
           MOVE SPACES TO SCR-HDR-MRCA IN SCR-NDOC.
           MOVE SPACES TO SCR-HDR-CART IN SCR-NDOC.
           MOVE SPACES TO SCR-HDR-LENG IN SCR-NDOC.
           MOVE SPACES TO SCR-HDR-PAIS IN SCR-NDOC.
           MOVE SPACES TO SCR-HDR-VRNT IN SCR-NDOC.
           MOVE SPACES TO SCR-NDOC-DISP IN SCR-NDOC.
           MOVE SPACES TO SCR-FRET IN SCR-VARI.
           MOVE SPACES TO SCR-IPRV IN SCR-VARI.
           MOVE SPACES TO SCR-MFLD IN SCR-VARI.
           MOVE SPACES TO SCR-VFLD IN SCR-VARI.
           MOVE SPACES TO SCR-FFLD IN SCR-VARI.
           MOVE SPACES TO SCR-OFRM IN SCR-VARI.
           MOVE SPACES TO SCR-IERR IN SCR-VARI.
           MOVE LOW-VALUE TO SCR-ORIG IN SCR-VARI.
           MOVE SPACES TO SCR-MODO IN SCR-ORIG.
           MOVE SPACES TO SCR-CNAL IN SCR-ORIG.
           MOVE SPACES TO SCR-DISP IN SCR-VARI.
           MOVE SPACES TO FILLER-CIC IN CIC-FLD.
           MOVE 0 TO CIC-COD-TCIC-LEN IN CIC-FLD.
           MOVE SPACES TO CIC-COD-TCIC-ATR IN CIC-FLD.
           MOVE SPACES TO CIC-COD-TCIC IN CIC-FLD.
           MOVE 0 TO CIC-COD-CCIC-LEN IN CIC-FLD.
           MOVE SPACES TO CIC-COD-CCIC-ATR IN CIC-FLD.
           MOVE SPACES TO CIC-COD-CCIC IN CIC-FLD.
           MOVE 0 TO CIC-NUM-ICIC-LEN IN CIC-FLD.
           MOVE SPACES TO CIC-NUM-ICIC-ATR IN CIC-FLD.
           MOVE SPACES TO CIC-NUM-ICIC-ALF IN CIC-FLD.
           MOVE 0 TO CIC-IND-VIGE-LEN IN CIC-FLD.
           MOVE SPACES TO CIC-IND-VIGE-ATR IN CIC-FLD.
           MOVE SPACES TO CIC-IND-VIGE IN CIC-FLD.
           MOVE 0 TO CIC-GLS-MENS-LEN IN CIC-FLD.
           MOVE SPACES TO CIC-GLS-MENS-ATR IN CIC-FLD.
           MOVE LOW-VALUE TO CIC-GLS-MENS IN CIC-FLD.
           MOVE SPACES TO CIC-GLS-MEN1 IN CIC-GLS-MENS.
           MOVE SPACES TO CIC-GLS-MEN2 IN CIC-GLS-MENS.
           MOVE SPACES TO CIC-COD-TCIC-STP IN CIC-STP.
           MOVE SPACES TO CIC-COD-CCIC-STP IN CIC-STP.
           MOVE SPACES TO CIC-NUM-ICIC-STP IN CIC-STP.
           MOVE SPACES TO CIC-IND-VIGE-STP IN CIC-STP.
           MOVE 0 TO CIC-NUM-ICIC-EDT IN CIC-EDT.
           MOVE SPACES TO CIC-GLS-FLAG IN CIC.
           MOVE LOW-VALUE TO CIC-KEY-IREG IN CIC.
           MOVE LOW-VALUE TO CIC-KEY-ICIC IN CIC-KEY-IREG.
           MOVE LOW-VALUE TO CIC-CIC-ICIC IN CIC-KEY-ICIC.
           MOVE LOW-VALUE TO CIC-CAI-ICIC IN CIC-CIC-ICIC.
           MOVE SPACES TO CIC-COD-TCIC IN CIC-CAI-ICIC.
           MOVE SPACES TO CIC-COD-CCIC IN CIC-CAI-ICIC.
           MOVE 0 TO CIC-NUM-ICIC IN CIC-CIC-ICIC.
           MOVE LOW-VALUE TO CIC-STP-ITRN IN CIC-KEY-IREG.
           MOVE LOW-VALUE TO CIC-FEC-FTRN IN CIC-STP-ITRN.
           MOVE 0 TO CIC-NUM-STRN IN CIC-FEC-FTRN.
           MOVE 0 TO CIC-NUM-ATRN IN CIC-FEC-FTRN.
           MOVE 0 TO CIC-NUM-MTRN IN CIC-FEC-FTRN.
           MOVE 0 TO CIC-NUM-DTRN IN CIC-FEC-FTRN.
           MOVE LOW-VALUE TO CIC-HRA-HRTR IN CIC-STP-ITRN.
           MOVE 0 TO CIC-NUM-HHTR IN CIC-HRA-HRTR.
           MOVE 0 TO CIC-NUM-MMTR IN CIC-HRA-HRTR.
           MOVE 0 TO CIC-NUM-SSTR IN CIC-HRA-HRTR.
           MOVE SPACES TO CIC-MSC-TACC IN CIC.
           MOVE SPACES TO CIC-MSC-STAT IN CIC.
           MOVE LOW-VALUE TO CIC-COD-OTRN IN CIC.
           MOVE SPACES TO CIC-MSC-TTRN IN CIC-COD-OTRN.
           MOVE SPACES TO CIC-COD-TTRN IN CIC-COD-OTRN.
           MOVE SPACES TO CIC-COD-ATRN IN CIC.
           MOVE SPACES TO CIC-GLS-DISP IN CIC.
           MOVE SPACES TO IDD-PROG IN IDD-VARI.
           MOVE LOW-VALUE TO IDD-DAUX IN IDD-VARI.
           MOVE SPACES TO IDD-SAUX IN IDD-DAUX.
           MOVE SPACES TO IDD-GAUX IN IDD-DAUX.
           MOVE SPACES TO IDD-RAUX IN IDD-DAUX.
           MOVE 0 TO IDD-IAUX IN IDD-VARI.
           MOVE LOW-VALUE TO IDD-REGI IN IDD-VARI.
           MOVE SPACES TO IDD-CIDD IN IDD-REGI.
           MOVE LOW-VALUE TO IDD-FSIS IN IDD-REGI.
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(1).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(2).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(3).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(4).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(5).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(6).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(7).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(8).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(9).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(10).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(11).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(12).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(13).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(14).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(15).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(16).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(17).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(18).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(19).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(20).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(21).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(22).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(23).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(24).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(25).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(26).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(27).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(28).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(29).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(30).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(31).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(32).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(33).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(34).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(35).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(36).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(37).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(38).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(39).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(40).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(41).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(42).
           MOVE LOW-VALUE TO IDD-DENT IN IDD-VSIS(43).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(1).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(2).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(3).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(4).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(5).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(6).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(7).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(8).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(9).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(10).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(11).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(12).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(13).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(14).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(15).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(16).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(17).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(18).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(19).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(20).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(21).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(22).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(23).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(24).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(25).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(26).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(27).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(28).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(29).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(30).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(31).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(32).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(33).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(34).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(35).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(36).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(37).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(38).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(39).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(40).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(41).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(42).
           MOVE SPACES TO IDD-TENT IN IDD-VSIS(43).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(1).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(2).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(3).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(4).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(5).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(6).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(7).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(8).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(9).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(10).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(11).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(12).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(13).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(14).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(15).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(16).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(17).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(18).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(19).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(20).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(21).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(22).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(23).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(24).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(25).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(26).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(27).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(28).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(29).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(30).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(31).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(32).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(33).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(34).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(35).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(36).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(37).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(38).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(39).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(40).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(41).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(42).
           MOVE SPACES TO IDD-IENT IN IDD-VSIS(43).
           MOVE SPACES TO ADR-PROG IN ADR-UIFB.
           MOVE SPACES TO ADR-ELM1 IN ADR-ELLS.
           MOVE SPACES TO ADR-CSEG IN ADR-ELLS.
           MOVE SPACES TO TAB-GLS-FLAG IN TAB.
           MOVE LOW-VALUE TO TAB-KEY-IREG IN TAB.
           MOVE LOW-VALUE TO TAB-KY0-TABS IN TAB-KEY-IREG.
           MOVE LOW-VALUE TO TAB-COD-TABL IN TAB-KY0-TABS.
           MOVE SPACES TO TAB-COD-TTAB IN TAB-COD-TABL.
           MOVE SPACES TO TAB-COD-CTAB IN TAB-COD-TABL.
           MOVE LOW-VALUE TO TAB-COD-ITRS IN TAB-KEY-IREG.
           MOVE LOW-VALUE TO TAB-STP-ITRN IN TAB-COD-ITRS.
           MOVE LOW-VALUE TO TAB-FEC-FTRN IN TAB-STP-ITRN.
           MOVE 0 TO TAB-NUM-STRN IN TAB-FEC-FTRN.
           MOVE 0 TO TAB-NUM-ATRN IN TAB-FEC-FTRN.
           MOVE 0 TO TAB-NUM-MTRN IN TAB-FEC-FTRN.
           MOVE 0 TO TAB-NUM-DTRN IN TAB-FEC-FTRN.
           MOVE LOW-VALUE TO TAB-HRA-HRTR IN TAB-STP-ITRN.
           MOVE 0 TO TAB-NUM-HHTR IN TAB-HRA-HRTR.
           MOVE 0 TO TAB-NUM-MMTR IN TAB-HRA-HRTR.
           MOVE 0 TO TAB-NUM-SSTR IN TAB-HRA-HRTR.
           MOVE SPACES TO TAB-MSC-TACC IN TAB.
           MOVE SPACES TO TAB-MSC-STAT IN TAB.
           MOVE LOW-VALUE TO TAB-COD-OTRN IN TAB.
           MOVE SPACES TO TAB-MSC-TTRN IN TAB-COD-OTRN.
           MOVE SPACES TO TAB-COD-TTRN IN TAB-COD-OTRN.
           MOVE SPACES TO TAB-COD-ATRN IN TAB.
           MOVE LOW-VALUE TO TAB-KY1-TABS IN TAB.
           MOVE LOW-VALUE TO TAB-CIC-TABL IN TAB-KY1-TABS.
           MOVE SPACES TO TAB-CIC-TTAB IN TAB-CIC-TABL.
           MOVE SPACES TO TAB-CIC-CTAB IN TAB-CIC-TABL.
           MOVE LOW-VALUE TO TAB-KY2-TABS IN TAB.
           MOVE LOW-VALUE TO TAB-EXT-TABL IN TAB-KY2-TABS.
           MOVE SPACES TO TAB-EXT-TTAB IN TAB-EXT-TABL.
           MOVE SPACES TO TAB-EXT-CTAB IN TAB-EXT-TABL.
           MOVE SPACES TO TAB-GLS-DCOR IN TAB.
           MOVE SPACES TO TAB-GLS-ABRV IN TAB.
           MOVE SPACES TO TAB-GLS-DESC IN TAB.
           MOVE LOW-VALUE TO TAB-GLS-DATA IN TAB.
           MOVE LOW-VALUE TO TAB-GLS-DAT1 IN TAB-GLS-DATA.
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(1).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(2).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(3).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(4).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(5).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(6).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(7).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(8).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(9).
           MOVE SPACES TO TAB-COD-DAT1 IN TAB-GLS-DAT1(10).
           MOVE LOW-VALUE TO TAB-GLS-DAT2 IN TAB-GLS-DATA.
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(1).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(2).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(3).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(4).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(5).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(6).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(7).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(8).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(9).
           MOVE SPACES TO TAB-COD-DAT2 IN TAB-GLS-DAT2(10).
           MOVE LOW-VALUE TO TAB-GLS-DAT3 IN TAB-GLS-DATA.
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(1).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(2).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(3).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(4).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(5).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(6).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(7).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(8).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(9).
           MOVE SPACES TO TAB-COD-DAT3 IN TAB-GLS-DAT3(10).
           MOVE LOW-VALUE TO TAB-SNX-TABL IN TAB.
           MOVE SPACES TO TAB-SNX-TTAB IN TAB-SNX-TABL.
           MOVE SPACES TO TAB-SNX-CTAB IN TAB-SNX-TABL.
           MOVE LOW-VALUE TO TAB-GLS-FTAB IN TAB-VARI.
           MOVE SPACES TO TAB-COD-SIST IN TAB-GLS-FTAB.
           MOVE 'PFTAB' TO TAB-COD-FTAB IN TAB-GLS-FTAB.
           MOVE SPACES TO MSG-GLS-FLAG IN MSG.
           MOVE LOW-VALUE TO MSG-KEY-IREG IN MSG.
           MOVE LOW-VALUE TO MSG-KY0-TABS IN MSG-KEY-IREG.
           MOVE LOW-VALUE TO MSG-COD-TABL IN MSG-KY0-TABS.
           MOVE SPACES TO MSG-COD-TTAB IN MSG-COD-TABL.
           MOVE LOW-VALUE TO MSG-COD-MENS IN MSG-COD-TABL.
           MOVE SPACES TO MSG-COD-TMSG IN MSG-COD-MENS.
           MOVE SPACES TO MSG-COD-CMSG IN MSG-COD-MENS.
           MOVE LOW-VALUE TO MSG-COD-ITRS IN MSG-KEY-IREG.
           MOVE LOW-VALUE TO MSG-STP-ITRN IN MSG-COD-ITRS.
           MOVE LOW-VALUE TO MSG-FEC-FTRN IN MSG-STP-ITRN.
           MOVE 0 TO MSG-NUM-STRN IN MSG-FEC-FTRN.
           MOVE 0 TO MSG-NUM-ATRN IN MSG-FEC-FTRN.
           MOVE 0 TO MSG-NUM-MTRN IN MSG-FEC-FTRN.
           MOVE 0 TO MSG-NUM-DTRN IN MSG-FEC-FTRN.
           MOVE LOW-VALUE TO MSG-HRA-HRTR IN MSG-STP-ITRN.
           MOVE 0 TO MSG-NUM-HHTR IN MSG-HRA-HRTR.
           MOVE 0 TO MSG-NUM-MMTR IN MSG-HRA-HRTR.
           MOVE 0 TO MSG-NUM-SSTR IN MSG-HRA-HRTR.
           MOVE SPACES TO MSG-MSC-TACC IN MSG.
           MOVE SPACES TO MSG-MSC-STAT IN MSG.
           MOVE LOW-VALUE TO MSG-COD-OTRN IN MSG.
           MOVE SPACES TO MSG-MSC-TTRN IN MSG-COD-OTRN.
           MOVE SPACES TO MSG-COD-TTRN IN MSG-COD-OTRN.
           MOVE SPACES TO MSG-COD-ATRN IN MSG.
           MOVE LOW-VALUE TO MSG-KY1-TABS IN MSG.
           MOVE LOW-VALUE TO MSG-CIC-TABL IN MSG-KY1-TABS.
           MOVE SPACES TO MSG-CIC-TTAB IN MSG-CIC-TABL.
           MOVE LOW-VALUE TO MSG-CIC-MENS IN MSG-CIC-TABL.
           MOVE SPACES TO MSG-CIC-TMSG IN MSG-CIC-MENS.
           MOVE SPACES TO MSG-CIC-CMSG IN MSG-CIC-MENS.
           MOVE LOW-VALUE TO MSG-KY2-TABS IN MSG.
           MOVE LOW-VALUE TO MSG-EXT-TABL IN MSG-KY2-TABS.
           MOVE SPACES TO MSG-EXT-TTAB IN MSG-EXT-TABL.
           MOVE SPACES TO MSG-EXT-CTAB IN MSG-EXT-TABL.
           MOVE SPACES TO MSG-GLS-DCOR IN MSG.
           MOVE SPACES TO MSG-GLS-ABRV IN MSG.
           MOVE LOW-VALUE TO MSG-GLS-DESC IN MSG.
           MOVE SPACES TO MSG-GLS-DES1 IN MSG-GLS-DESC.
           MOVE SPACES TO MSG-GLS-DES2 IN MSG-GLS-DESC.
           MOVE LOW-VALUE TO MSG-GLS-DATA IN MSG.
           MOVE SPACES TO MSG-GLS-MENS IN MSG-GLS-DATA.
           MOVE SPACES TO MSG-GLS-DISP IN MSG-GLS-DATA.
           MOVE LOW-VALUE TO MSG-SNX-TABL IN MSG.
           MOVE SPACES TO MSG-SNX-TTAB IN MSG-SNX-TABL.
           MOVE SPACES TO MSG-SNX-MENS IN MSG-SNX-TABL.
           MOVE LOW-VALUE TO MSG-GLS-FMSG IN MSG-VARI.
           MOVE SPACES TO MSG-COD-SIST IN MSG-GLS-FMSG.
           MOVE 'PFTAB' TO MSG-COD-FMSG IN MSG-GLS-FMSG.
           MOVE 0 TO FIO-ACCS-DEF IN FIO-CTTS.
           MOVE 1 TO FIO-ACCS-NOT IN FIO-CTTS.
           MOVE 2 TO FIO-ACCS-INP IN FIO-CTTS.
           MOVE 3 TO FIO-ACCS-UPD IN FIO-CTTS.
           MOVE 0 TO FIO-RLCK-FIO IN FIO-CTTS.
           MOVE 1 TO FIO-RLCK-PGM IN FIO-CTTS.
           MOVE 0 TO FIO-IFNF-FIO IN FIO-CTTS.
           MOVE 1 TO FIO-IFNF-PGM IN FIO-CTTS.
           MOVE '39' TO FIO-STAT-NEX IN FIO-CTTS.
           MOVE LOW-VALUE TO FIO-VCMN IN FIO-CTTS.
           MOVE 1 TO FIO-GET-KEY IN FIO-VCMN.
           MOVE 2 TO FIO-GET-NXT IN FIO-VCMN.
           MOVE 3 TO FIO-GET-FST IN FIO-VCMN.
           MOVE 4 TO FIO-GET-NLS IN FIO-VCMN.
           MOVE 5 TO FIO-GET-GRT IN FIO-VCMN.
           MOVE 6 TO FIO-PUT IN FIO-VCMN.
           MOVE 7 TO FIO-MOD IN FIO-VCMN.
           MOVE 8 TO FIO-DEL IN FIO-VCMN.
           MOVE 9 TO FIO-CHG IN FIO-VCMN.
           MOVE 10 TO FIO-INP IN FIO-VCMN.
           MOVE 11 TO FIO-OUT IN FIO-VCMN.
           MOVE 12 TO FIO-UPD IN FIO-VCMN.
           MOVE 13 TO FIO-CLO IN FIO-VCMN.
           MOVE 14 TO FIO-FND-EQL IN FIO-VCMN.
           MOVE 15 TO FIO-FND-FST IN FIO-VCMN.
           MOVE 16 TO FIO-FND-NLS IN FIO-VCMN.
           MOVE 17 TO FIO-FND-GRT IN FIO-VCMN.
           MOVE 18 TO FIO-ULK-REC IN FIO-VCMN.
           MOVE 19 TO FIO-ULK-ALL IN FIO-VCMN.
           MOVE 20 TO FIO-VID IN FIO-VCMN.
           MOVE 21 TO FIO-ACC IN FIO-VCMN.
           MOVE 22 TO FIO-REC-LCK IN FIO-VCMN.
           MOVE 23 TO FIO-FNF IN FIO-VCMN.
           MOVE 24 TO FIO-REC-LEN IN FIO-VCMN.
           MOVE 25 TO FIO-EXT IN FIO-VCMN.
           MOVE 26 TO FIO-GET-KEY-ALT IN FIO-VCMN.
           MOVE 27 TO FIO-GET-FST-ALT IN FIO-VCMN.
           MOVE 28 TO FIO-GET-NLS-ALT IN FIO-VCMN.
           MOVE 29 TO FIO-GET-GRT-ALT IN FIO-VCMN.
           MOVE 30 TO FIO-FND-EQL-ALT IN FIO-VCMN.
           MOVE 31 TO FIO-FND-FST-ALT IN FIO-VCMN.
           MOVE 32 TO FIO-FND-NLS-ALT IN FIO-VCMN.
           MOVE 33 TO FIO-FND-GRT-ALT IN FIO-VCMN.
           MOVE 34 TO FIO-GET-NXT-ALT IN FIO-VCMN.
           MOVE 35 TO FIO-GET-KEY-UPD-ALT IN FIO-VCMN.
           MOVE 36 TO FIO-GET-KEY-UPD IN FIO-VCMN.
           MOVE 37 TO FIO-END-BRW IN FIO-VCMN.
           MOVE 38 TO FIO-BCK-OUT IN FIO-VCMN.
           MOVE 39 TO FIO-GET-LEQ IN FIO-VCMN.
           MOVE 40 TO FIO-GET-PRV IN FIO-VCMN.
           MOVE 41 TO FIO-CHK-PNT IN FIO-VCMN.
           MOVE 42 TO FIO-BFR-RFH IN FIO-VCMN.
           MOVE 43 TO FIO-EBR-ALL IN FIO-VCMN.
           MOVE 44 TO FIO-BEG-TRN IN FIO-VCMN.
           MOVE SPACES TO FIO-PROG IN FIO-CTTS.
           MOVE SPACES TO FIO-GLS-PROG IN FIO-CTTS.
           MOVE SPACES TO FIO-VKEY IN FIO-CTTS.
           MOVE SPACES TO FIO-CKEY IN FIO-CTTS.
           MOVE 0 TO FIO-KLEN IN FIO-CTTS.
           MOVE SPACES TO FIO-DFLD IN FIO-CTTS.
           MOVE SPACES TO FIO-MENS IN FIO-CTTS.
           MOVE SPACES TO FIO-MEN1 IN FIO-MENS.
           MOVE SPACES TO FIO-MEN2 IN FIO-MENS.
           MOVE 0 TO FIO-IAKY IN FIO-CTTS.
           MOVE 0 TO FIO-IGET IN FIO-CTTS.
           MOVE 0 TO FIO-KDEF IN FIO-CTTS.
           MOVE 0 TO FIO-KDEF-N IN FIO-CTTS.
           MOVE 1 TO FIO-KDEF-S IN FIO-CTTS.
           MOVE SPACES TO FIO-IVEZ IN FIO-CTTS.
           MOVE SPACES TO FIO-MSFL IN FIO-CTTS.
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(1).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(2).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(3).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(4).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(5).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(6).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(7).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(8).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(9).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(10).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(11).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(12).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(13).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(14).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(15).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(16).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(17).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(18).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(19).
           MOVE SPACES TO FIO-NFIL IN FIO-VSFL(20).
           MOVE 20 TO FIO-MXFL IN FIO-CTTS.
           MOVE 'N' TO FIO-ISBR IN FIO-CTTS.
           MOVE 0 TO FIO-IAUX IN FIO-CTTS.
           MOVE SPACES TO FIO-ORACLE-VARI IN FIO-ORACLE.
           MOVE SPACES TO FIO-ORACLE-DFLD IN FIO-ORACLE.
           MOVE SPACES TO FIO-ORACLE-RQA IN FIO-ORACLE.
           MOVE SPACES TO FIO-ORACLE-MENS IN FIO-ORACLE.
           MOVE LOW-VALUE TO FIO-ORACLE-PROG IN FIO-ORACLE.
           MOVE SPACES TO FIO-ORACLE-PROG-TAB IN FIO-ORACLE-PROG.
           MOVE 0 TO FIO-ORACLE-PROG-NUM IN FIO-ORACLE-PROG.
           MOVE SPACES TO FIO-ORACLE-FILL IN FIO-ORACLE.
           MOVE SPACES TO RECV-STRING-FIO.
           MOVE SPACES TO SEND-STRING-FIO.
           MOVE SPACES TO FIO-AKEY IN FIO-VARI.
           MOVE LOW-VALUE TO FIO-STAT IN FIO-VARI.
           MOVE 0 TO FIO-STT1 IN FIO-STAT.
           MOVE 0 TO FIO-STT2 IN FIO-STAT.
           MOVE 0 TO FIO-RKEY IN FIO-VARI.
           MOVE 0 TO FIO-CMND IN FIO-VARI.
           MOVE 0 TO FIO-ACCS IN FIO-VARI.
           MOVE 0 TO FIO-RLCK IN FIO-VARI.
           MOVE 0 TO FIO-IFNF IN FIO-VARI.
           MOVE 0 TO FIO-RLEN IN FIO-VARI.
           MOVE LOW-VALUE TO FIO-VOID IN FIO-VARI.
           MOVE SPACES TO FIO-SIST IN FIO-VOID.
           MOVE SPACES TO FIO-FTYP IN FIO-VOID.
           MOVE SPACES TO FIO-FNAM IN FIO-VOID.
           MOVE SPACES TO FIO-SIST-BKP IN FIO-VARI.
           MOVE 0 TO TP-RETURN-VAL IN TPSVCRET-REC.
           MOVE 0 TO APPL-CODE IN TPSVCRET-REC.
           MOVE SPACES TO REC-TYPE IN TPTYPE-REC.
           MOVE SPACES TO SUB-TYPE IN TPTYPE-REC.
           MOVE 0 TO LEN IN TPTYPE-REC.
           MOVE 0 TO TPTYPE-STATUS IN TPTYPE-REC.
           MOVE 0 TO TP-STATUS IN TPSTATUS-REC.
           MOVE 0 TO TPEVENT IN TPSTATUS-REC.
           MOVE 0 TO APPL-RETURN-CODE IN TPSTATUS-REC.
           MOVE 0 TO COMM-HANDLE IN TPSVCDEF-REC.
           MOVE 0 TO TPBLOCK-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPTRAN-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPREPLY-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPTIME-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPSIGRSTRT-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPGETANY-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPSENDRECV-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPNOCHANGE-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO TPSERVICETYPE-FLAG IN TPSVCDEF-REC.
           MOVE 0 TO APPKEY IN TPSVCDEF-REC.
           MOVE 0 TO CLIENTID IN TPSVCDEF-REC(1).
           MOVE 0 TO CLIENTID IN TPSVCDEF-REC(2).
           MOVE 0 TO CLIENTID IN TPSVCDEF-REC(3).
           MOVE 0 TO CLIENTID IN TPSVCDEF-REC(4).
           MOVE SPACES TO SERVICE-NAME IN TPSVCDEF-REC.
           MOVE 'GNSPQTAB :' TO LOGMSG-PROG IN LOGMSG.
           MOVE '00' TO LOGMSG-NUMB IN LOGMSG.
           MOVE '00000000' TO LOGMSG-TIME IN LOGMSG.
           MOVE LOW-VALUE TO LOGMSG-TEXT IN LOGMSG.
           MOVE SPACES TO LOGMSG-TEXT-1 IN LOGMSG-TEXT.
           MOVE SPACES TO LOGMSG-TEXT-2 IN LOGMSG-TEXT.
           MOVE SPACES TO LOGMSG-TEXT-3 IN LOGMSG-TEXT.
           MOVE 0 TO LOGMSG-LEN.
           MOVE 0 TO FRM-TCMA IN FRM-VARI.
           MOVE LOW-VALUE TO FRM-CMMA IN FRM-VARI.
           MOVE SPACES TO FRM-SCR-MENS IN FRM-CMMA.
           MOVE SPACES TO FRM-SCR-VARI IN FRM-CMMA.
           MOVE SPACES TO FRM-STAT IN FRM-VARI.
           MOVE SPACES TO FRM-NAME IN FRM-VARI.
           MOVE SPACES TO FRM-NLIB IN FRM-VARI.
           MOVE 1 TO FRM-PLIN IN FRM-VARI.
           MOVE 0 TO FRM-NLIN IN FRM-VARI.
           MOVE 0 TO FRM-PCUR IN FRM-VARI.
           MOVE SPACES TO FRM-UCUR IN FRM-VARI.
           MOVE 0 TO FRM-TFLD IN FRM-VARI.
           MOVE SPACES TO FRM-AUXI IN FRM-VARI.
           MOVE LOW-VALUE TO FRM-DFLD IN FRM-VARI.
           MOVE SPACES TO FRM-COD-MENS IN FRM-DFLD.
           MOVE SPACES TO FRM-GLS-MENS IN FRM-DFLD.
           MOVE LOW-VALUE TO FRM-DATA IN FRM-DFLD.
           MOVE SPACES TO FRM-NAME-IDEN IN FRM-DATA.
           MOVE SPACES TO FRM-NAME-CMPL IN FRM-DATA.
           MOVE 0 TO FRM-LFLD IN FRM-VARI.
           MOVE 0 TO FRM-IFLD IN FRM-VARI.
           MOVE SPACES TO FRM-MENS IN FRM-VARI.
           MOVE SPACES TO FRM-ABRV IN FRM-VARI.
           MOVE SPACES TO FRM-FFLD IN FRM-VARI.
           MOVE SPACES TO FRM-SUAR IN FRM-VARI.
           MOVE 0 TO FRM-SINI IN FRM-VARI.
           MOVE 0 TO FRM-CMND IN FRM-VARI.
           MOVE SPACES TO FRM-IHDL IN FRM-VARI.
           MOVE LOW-VALUE TO FRM-COLA IN FRM-VARI.
           MOVE SPACES TO FRM-TERM IN FRM-COLA.
           MOVE SPACES TO FRM-TYPE IN FRM-COLA.
           MOVE 0 TO FRM-LITM IN FRM-VARI.
           MOVE 1 TO FRM-INI IN FRM-CTTS.
           MOVE 2 TO FRM-GET-ALL IN FRM-CTTS.
           MOVE 3 TO FRM-PUT-ALL IN FRM-CTTS.
           MOVE 4 TO FRM-CLR-ALL IN FRM-CTTS.
           MOVE 5 TO FRM-MSG IN FRM-CTTS.
           MOVE 6 TO FRM-RCV IN FRM-CTTS.
           MOVE 10 TO FRM-ABT IN FRM-CTTS.
           MOVE 7 TO FRM-CLR-FRM IN FRM-CTTS.
           MOVE 0 TO FRM-SINI-DB1F IN FRM-CTTS.
           MOVE 1 TO FRM-SINI-DBNF IN FRM-CTTS.
           MOVE 2 TO FRM-SINI-DBLF IN FRM-CTTS.
           MOVE 3 TO FRM-SINI-MB1F IN FRM-CTTS.
           MOVE 4 TO FRM-SINI-MBNF IN FRM-CTTS.
           MOVE 5 TO FRM-SINI-MBLF IN FRM-CTTS.
           MOVE '%' TO FRM-FFLD-PA1 IN FRM-CTTS.
           MOVE '>' TO FRM-FFLD-PA2 IN FRM-CTTS.
           MOVE ',' TO FRM-FFLD-PA3 IN FRM-CTTS.
           MOVE '''' TO FRM-FFLD-RET IN FRM-CTTS.
           MOVE '3' TO FRM-FFLD-TAB IN FRM-CTTS.
           MOVE '1' TO FRM-FFLD-PF1 IN FRM-CTTS.
           MOVE '2' TO FRM-FFLD-PF2 IN FRM-CTTS.
           MOVE '3' TO FRM-FFLD-PF3 IN FRM-CTTS.
           MOVE '4' TO FRM-FFLD-PF4 IN FRM-CTTS.
           MOVE '5' TO FRM-FFLD-PF5 IN FRM-CTTS.
           MOVE '6' TO FRM-FFLD-PF6 IN FRM-CTTS.
           MOVE '7' TO FRM-FFLD-PF7 IN FRM-CTTS.
           MOVE '8' TO FRM-FFLD-PF8 IN FRM-CTTS.
           MOVE '9' TO FRM-FFLD-PF9 IN FRM-CTTS.
           MOVE ':' TO FRM-FFLD-PF10 IN FRM-CTTS.
           MOVE '#' TO FRM-FFLD-PF11 IN FRM-CTTS.
           MOVE '@' TO FRM-FFLD-PF12 IN FRM-CTTS.
           MOVE 'A' TO FRM-FFLD-PFA IN FRM-CTTS.
           MOVE 'B' TO FRM-FFLD-PFB IN FRM-CTTS.
           MOVE 'C' TO FRM-FFLD-PFC IN FRM-CTTS.
           MOVE 'D' TO FRM-FFLD-PFD IN FRM-CTTS.
           MOVE 'E' TO FRM-FFLD-PFE IN FRM-CTTS.
           MOVE 'F' TO FRM-FFLD-PFF IN FRM-CTTS.
           MOVE 'G' TO FRM-FFLD-PFG IN FRM-CTTS.
           MOVE 'H' TO FRM-FFLD-PFH IN FRM-CTTS.
           MOVE 'I' TO FRM-FFLD-PFI IN FRM-CTTS.
           MOVE '?' TO FRM-FFLD-PFJ IN FRM-CTTS.
           MOVE '.' TO FRM-FFLD-PFK IN FRM-CTTS.
           MOVE '<' TO FRM-FFLD-PFL IN FRM-CTTS.
           MOVE 'MAL' TO FRM-SUAR-MAL IN FRM-CTTS.
           MOVE 'WRN' TO FRM-SUAR-WRN IN FRM-CTTS.
           MOVE 'CLR' TO FRM-SUAR-CLR IN FRM-CTTS.
           MOVE 'OKS' TO FRM-SUAR-OKS IN FRM-CTTS.
           MOVE LOW-VALUE TO FRM-CPIM IN FRM-CTTS.
           MOVE '1' TO FRM-CPIM-AEY IN FRM-CPIM.
           MOVE 'I' TO FRM-CPIM-UBY IN FRM-CPIM.
           MOVE '_' TO FRM-CPIM-ANY IN FRM-CPIM.
           MOVE '(' TO FRM-CPIM-UNY IN FRM-CPIM.
           MOVE '-' TO FRM-CPSF-AEY IN FRM-CPIM.
           MOVE '9' TO FRM-CPIM-ABY IN FRM-CPIM.
           MOVE SPACES TO FRM-CPIM-UST IN FRM-CPIM.
           MOVE -1 TO FRM-POS-CURS IN FRM-CTTS.
           MOVE -1 TO FRM-IND-ERRO IN FRM-CTTS.
           MOVE -9 TO FRM-ERR-NUME IN FRM-CTTS.
           MOVE ZEROES TO FRM-RST-PCUR IN FRM-CTTS.
           MOVE 0 TO TSK-TX-STATUS IN TSK-TX-RETURN-STATUS.
           MOVE LOW-VALUE TO TSK-XID-REC IN TSK-TX-INFO-AREA.
           MOVE 0 TO TSK-FORMAT-ID IN TSK-XID-REC.
           MOVE 0 TO TSK-GTRID-LENGTH IN TSK-XID-REC.
           MOVE 0 TO TSK-BRANCH-LENGTH IN TSK-XID-REC.
           MOVE SPACES TO TSK-XID-DATA IN TSK-XID-REC.
           MOVE 0 TO TSK-TRANSACTION-MODE IN TSK-TX-INFO-AREA.
           MOVE 0 TO TSK-COMMIT-RETURN IN TSK-TX-INFO-AREA.
           MOVE 0 TO TSK-TRANSACTION-CONTROL IN TSK-TX-INFO-AREA.
           MOVE 0 TO TSK-TRANSACTION-TIMEOUT IN TSK-TX-INFO-AREA.
           MOVE 0 TO TSK-TRANSACTION-STATE IN TSK-TX-INFO-AREA.
           MOVE 0 TO TPTRXLEV-FLAG IN TPTRXLEV-REC.
           MOVE 0 TO T-OUT IN TPTRXDEF-REC.
           MOVE 0 TO TRANID IN TPTRXDEF-REC(1).
           MOVE 0 TO TRANID IN TPTRXDEF-REC(2).
           MOVE 0 TO TRANID IN TPTRXDEF-REC(3).
           MOVE 0 TO TRANID IN TPTRXDEF-REC(4).
           MOVE 0 TO TRANID IN TPTRXDEF-REC(5).
           MOVE 0 TO TRANID IN TPTRXDEF-REC(6).
           MOVE 'N' TO TSK-TERM-ORIGEN IN TSK-VARI.
           MOVE LOW-VALUE TO TSK-TRANID IN TSK-VARI.
           MOVE 0 TO TSK-TRANID-1 IN TSK-TRANID.
           MOVE 0 TO TSK-TRANID-2 IN TSK-TRANID.
           MOVE 0 TO TSK-TRANID-3 IN TSK-TRANID.
           MOVE 0 TO TSK-TRANID-4 IN TSK-TRANID.
           MOVE 0 TO TSK-TRANID-5 IN TSK-TRANID.
           MOVE 0 TO TSK-TRANID-6 IN TSK-TRANID.
           MOVE LOW-VALUE TO TSK-INFO-TRAN IN TSK-VARI.
           MOVE 0 TO TSK-INFO-TRANID IN TSK-INFO-TRAN.
           MOVE 0 TO TSK-INFO-COMMIT IN TSK-INFO-TRAN.
           MOVE 0 TO TSK-TERM-NUM IN TSK-VARI.
           MOVE SPACES TO TSK-TERM-TUX IN TSK-VARI.
           MOVE 0 TO TSK-TERM-NUM-TUX IN TSK-VARI.
           MOVE 0 TO TSK-TERM-NUM-TUX-6 IN TSK-VARI.
           MOVE LOW-VALUE TO HEADER-NOM-TSPT IN HEADER-VARI.
           MOVE 'HE' TO HEADER-COD-TERM IN HEADER-NOM-TSPT.
           MOVE SPACES TO HEADER-COD-TYPE IN HEADER-NOM-TSPT.
           MOVE SPACES TO HEADER-VERS IN HEADER-MENS.
           MOVE SPACES TO HEADER-BNCO IN HEADER-MENS.
           MOVE SPACES TO HEADER-MRCA IN HEADER-MENS.
           MOVE SPACES TO HEADER-CART IN HEADER-MENS.
           MOVE SPACES TO HEADER-LENG IN HEADER-MENS.
           MOVE SPACES TO HEADER-PAIS IN HEADER-MENS.
           MOVE SPACES TO HEADER-VRNT IN HEADER-MENS.
           MOVE SPACES TO HEADER-USER IN HEADER-MENS.
           MOVE SPACES TO HEADER-CNAL IN HEADER-MENS.
           MOVE SPACES TO HEADER-UMUA IN HEADER-MENS.
           MOVE SPACES TO HEADER-PROG IN HEADER-MENS.
           MOVE SPACES TO HEADER-IBYA IN HEADER-MENS.
           MOVE SPACES TO HEADER-BCKI IN HEADER-MENS.
           MOVE SPACES TO HEADER-I24H IN HEADER-MENS.
           MOVE SPACES TO HEADER-MNSF IN HEADER-MENS.
           MOVE SPACES TO HEADER-ORIG IN HEADER-MENS.
           MOVE SPACES TO HEADER-MSGC IN HEADER-MENS.
           MOVE SPACES TO HEADER-MSGM IN HEADER-MENS.
           MOVE SPACES TO HEADER-DIS1 IN HEADER-MENS.
           MOVE LOW-VALUE TO HEADER-IREQ IN HEADER-MENS.
           MOVE SPACES TO HEADER-IR01 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR02 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR03 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR04 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR05 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR06 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR07 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR08 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR09 IN HEADER-IREQ.
           MOVE SPACES TO HEADER-IR10 IN HEADER-IREQ.
           MOVE LOW-VALUE TO MULMSG-NOM-TSPT IN MULMSG-VARI.
           MOVE SPACES TO MULMSG-COD-TERM IN MULMSG-NOM-TSPT.
           MOVE 'MMSG' TO MULMSG-COD-TYPE IN MULMSG-NOM-TSPT.
           MOVE SPACES TO MULMSG-TIPO IN MULMSG-MENS.
           MOVE SPACES TO MULMSG-FORM IN MULMSG-MENS.
           MOVE SPACES TO MULMSG-SIST IN MULMSG-MENS.
           MOVE SPACES TO MULMSG-CODI IN MULMSG-MENS.
           MOVE SPACES TO MULMSG-DATO IN MULMSG-MENS.
           MOVE LOW-VALUE TO QUE-COLA IN QUE-VARI.
           MOVE SPACES TO QUE-TERM IN QUE-COLA.
           MOVE SPACES TO QUE-TYPE IN QUE-COLA.
           MOVE +0 TO QUE-NITM IN QUE-VARI.
           MOVE 0 TO QUE-LITM IN QUE-VARI.
           MOVE LOW-VALUE TO QUE-ITEM IN QUE-VARI.
           MOVE SPACES TO QUE-IKEY IN QUE-ITEM.
           MOVE +0 TO QUE-LDAT IN QUE-ITEM.
           MOVE +0 TO QUE-PCUR IN QUE-ITEM.
           MOVE SPACES TO QUE-DATA IN QUE-ITEM.
           MOVE 'OKS' TO QUE-STAT IN QUE-VARI.
           MOVE 'OKS' TO QUE-STAT-OKS IN QUE-VARI.
           MOVE 'NEX' TO QUE-STAT-NEX IN QUE-VARI.
           MOVE 'EOQ' TO QUE-STAT-EOQ IN QUE-VARI.
           MOVE SPACES TO QUE-CMND IN QUE-VARI.
           MOVE LOW-VALUE TO QUE-MENS IN QUE-VARI.
           MOVE SPACES TO QUE-MEN1 IN QUE-MENS.
           MOVE SPACES TO QUE-MEN2 IN QUE-MENS.
           MOVE 0 TO QUE-NUM-STAT.
           MOVE 0 TO QUE-GLS-STAT.
           MOVE 'PUT' TO QUE-PUT IN QUE-CTTS.
           MOVE 'GET' TO QUE-GET IN QUE-CTTS.
           MOVE 'MOD' TO QUE-MOD IN QUE-CTTS.
           MOVE 'DEL' TO QUE-DEL IN QUE-CTTS.
           MOVE SPACES TO QUE-COM-SEND IN QUE-SEND.
           MOVE SPACES TO QUE-NAM-SEND IN QUE-SEND.
           MOVE 0 TO QUE-NUM-SEND IN QUE-SEND.
           MOVE 0 TO QUE-LAR-SEND IN QUE-SEND.
           MOVE SPACES TO QUE-TRX-SEND IN QUE-SEND.
           MOVE SPACES TO QUE-DAT-SEND IN QUE-SEND.
           MOVE 0 TO QUE-FIL-RECV IN QUE-RECV.
           MOVE 0 TO QUE-STA-RECV IN QUE-RECV.
           MOVE 0 TO QUE-NUM-RECV IN QUE-RECV.
           MOVE 0 TO QUE-LAR-RECV IN QUE-RECV.
           MOVE SPACES TO QUE-TRX-RECV IN QUE-RECV.
           MOVE SPACES TO QUE-DAT-RECV IN QUE-RECV.
           MOVE "CARRAY" TO QUE-REC-SEND-REC-TYPE IN
           QUE-TPTYPE-REC-SEND.
           MOVE SPACES TO QUE-REC-SEND-SUB-TYPE IN QUE-TPTYPE-REC-SEND.
           MOVE 9568 TO QUE-REC-SEND-LEN IN QUE-TPTYPE-REC-SEND.
           MOVE 0 TO QUE-REC-SEND-TPTYPE-STATUS IN QUE-TPTYPE-REC-SEND.
           MOVE "CARRAY" TO QUE-REC-RECV-REC-TYPE IN
           QUE-TPTYPE-REC-RECV.
           MOVE SPACES TO QUE-REC-RECV-SUB-TYPE IN QUE-TPTYPE-REC-RECV.
           MOVE 9285 TO QUE-REC-RECV-LEN IN QUE-TPTYPE-REC-RECV.
           MOVE 0 TO QUE-REC-RECV-TPTYPE-STATUS IN QUE-TPTYPE-REC-RECV.
           MOVE 0 TO QUE-COMM-HANDLE IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPBLOCK-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPTRAN-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPREPLY-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPTIME-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPSIGRSTRT-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPGETANY-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPSENDRECV-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPNOCHANGE-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-TPSERVICETYPE-FLAG IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-APPKEY IN QUE-TPSVCDEF-REC.
           MOVE 0 TO QUE-CLIENTID IN QUE-TPSVCDEF-REC(1).
           MOVE 0 TO QUE-CLIENTID IN QUE-TPSVCDEF-REC(2).
           MOVE 0 TO QUE-CLIENTID IN QUE-TPSVCDEF-REC(3).
           MOVE 0 TO QUE-CLIENTID IN QUE-TPSVCDEF-REC(4).
           MOVE "ts" TO QUE-SERVICE-NAME IN QUE-TPSVCDEF-REC.
           MOVE SPACES TO KEY-COD-ENTI IN KEY-VARI.
           MOVE SPACES TO KEY-GLS-NOMC IN KEY-VARI.
           MOVE LOW-VALUE TO KEY-CIC-IRUT IN KEY-VARI.
           MOVE 0 TO KEY-NUM-ICLI IN KEY-CIC-IRUT.
           MOVE SPACES TO KEY-VRF-ICLI IN KEY-CIC-IRUT.
           MOVE SPACES TO KEY-IND-ICLI IN KEY-CIC-IRUT.
           MOVE SPACES TO KEY-GLS-ICLI IN KEY-CIC-IRUT.
           MOVE LOW-VALUE TO KEY-CIC-IOPE IN KEY-VARI.
           MOVE SPACES TO KEY-CAI-IOPE IN KEY-CIC-IOPE.
           MOVE SPACES TO KEY-IIC-IOPE IN KEY-CIC-IOPE.
           MOVE LOW-VALUE TO KEY-FEC-FENT IN KEY-VARI.
           MOVE 0 TO KEY-NUM-DENT IN KEY-FEC-FENT.
           MOVE 0 TO KEY-NUM-MENT IN KEY-FEC-FENT.
           MOVE 0 TO KEY-NUM-SENT IN KEY-FEC-FENT.
           MOVE 0 TO KEY-NUM-AENT IN KEY-FEC-FENT.
           MOVE 0 TO KEY-NUM-IENT IN KEY-VARI.
           MOVE SPACES TO KEY-COD-IENT IN KEY-VARI.
           MOVE LOW-VALUE TO KEY-FEC-FCMT IN KEY-VARI.
           MOVE 0 TO KEY-NUM-DCMT IN KEY-FEC-FCMT.
           MOVE 0 TO KEY-NUM-MCMT IN KEY-FEC-FCMT.
           MOVE 0 TO KEY-NUM-SCMT IN KEY-FEC-FCMT.
           MOVE 0 TO KEY-NUM-ACMT IN KEY-FEC-FCMT.
           MOVE 0 TO KEY-NUM-GCMT IN KEY-VARI.
           MOVE SPACES TO KEY-COD-USER IN KEY-VARI.
           MOVE SPACES TO NUM-NUME IN NUM-VARI.
           MOVE LOW-VALUE TO NUM-CNDV IN NUM-VARI.
           MOVE 0 TO NUM-NENT IN NUM-CNDV.
           MOVE 0 TO NUM-NDCM IN NUM-CNDV.
           MOVE 0 TO NUM-ZERO IN NUM-CNDV.
           MOVE 0 TO NUM-SGNO IN NUM-CNDV.
           MOVE 0 TO NUM-STAT IN NUM-VARI.
           MOVE SPACES TO NUM-MENS IN NUM-VARI.
           MOVE LOW-VALUE TO NUM-NUMV IN NUM-VARI.
           MOVE 0 TO NUM-NS9V IN NUM-NUMV.
           MOVE 1 TO NUM-ZERO-N IN NUM-CTTS.
           MOVE 0 TO NUM-ZERO-S IN NUM-CTTS.
           MOVE 0 TO NUM-SGNO-N IN NUM-CTTS.
           MOVE 1 TO NUM-SGNO-S IN NUM-CTTS.
           MOVE LOW-VALUE TO SYS-FHOY-2B IN SYS-VARI.
           MOVE 0 TO SYS-AHOY-2B IN SYS-FHOY-2B.
           MOVE 0 TO SYS-MHOY-2B IN SYS-FHOY-2B.
           MOVE 0 TO SYS-DHOY-2B IN SYS-FHOY-2B.
           MOVE 0 TO SYS-SHOY IN SYS-VARI.
           MOVE LOW-VALUE TO SYS-FHOY IN SYS-VARI.
           MOVE 0 TO SYS-DHOY IN SYS-FHOY.
           MOVE SPACES TO SYS-SLH1 IN SYS-FHOY.
           MOVE 0 TO SYS-MHOY IN SYS-FHOY.
           MOVE SPACES TO SYS-SLH2 IN SYS-FHOY.
           MOVE 0 TO SYS-AHOY IN SYS-FHOY.
           MOVE ZEROES TO SYS-HHOY-2B IN SYS-VARI.
           MOVE ZEROES TO SYS-HHOY IN SYS-VARI.
           MOVE 0 TO SYS-JHOY IN SYS-VARI.
           MOVE LOW-VALUE TO SYS-TSTP IN SYS-VARI.
           MOVE 0 TO SYS-SSTP IN SYS-TSTP.
           MOVE LOW-VALUE TO SYS-FSTP IN SYS-TSTP.
           MOVE 0 TO SYS-AATS IN SYS-FSTP.
           MOVE 0 TO SYS-MMTS IN SYS-FSTP.
           MOVE 0 TO SYS-DDTS IN SYS-FSTP.
           MOVE 0 TO SYS-HSTP IN SYS-TSTP.
           MOVE 0 TO SYS-TCMA IN SYS-VARI.
           MOVE LOW-VALUE TO SYS-CMMA IN SYS-VARI.
           MOVE SPACES TO SYS-SCR-MENS IN SYS-CMMA.
           MOVE SPACES TO SYS-SCR-VARI IN SYS-CMMA.
           MOVE SPACES TO SYS-SCR-NTRN IN SYS-CMMA.
           MOVE SPACES TO SYS-NTRN IN SYS-VARI.
           MOVE SPACES TO SYS-PROG IN SYS-VARI.
           MOVE 'GNSPPABT' TO SYS-PABT IN SYS-VARI.
           MOVE 0 TO SYS-CMND IN SYS-VARI.
           MOVE LOW-VALUE TO SYS-MENS IN SYS-VARI.
           MOVE SPACES TO SYS-MEN1 IN SYS-MENS.
           MOVE SPACES TO SYS-MEN2 IN SYS-MENS.
           MOVE 0 TO SYS-REST IN SYS-VARI.
           MOVE 0 TO SYS-SIND IN SYS-VARI.
           MOVE SPACES TO SYS-STAT IN SYS-VARI.
           MOVE '00' TO SYS-STAT-OKS IN SYS-VARI.
           MOVE 0 TO SYS-STAT-NUM IN SYS-VARI.
           MOVE SPACES TO SYS-IHDL IN SYS-VARI.
           MOVE ' ' TO SYS-ABND IN SYS-VARI.
           MOVE 'N' TO SYS-SMFT IN SYS-VARI.
           MOVE 'N' TO SYS-HORA-HABI IN SYS-VARI.
           MOVE 'N' TO SYS-HORA-FLAG IN SYS-VARI.
           MOVE SPACES TO EIBTRMID.
           MOVE SPACES TO EIBTRNID.
           MOVE SPACES TO EIBTASKN.
           MOVE 1 TO EIBCALEN.
           MOVE '''' TO EIBAID.
           MOVE 0 TO EIBRESP.
           MOVE SPACES TO EIBTASKN-11 IN EIBTASKN-1.
           MOVE SPACES TO EIBTASKN-12 IN EIBTASKN-1.
           MOVE 'GNSPPFYH' TO FYH-PROG IN FYH-VARI.
           MOVE 22 TO FYH-TCMA IN FYH-VARI.
           MOVE SPACES TO FYH-CMSG IN FYH-VARI.
           MOVE LOW-VALUE TO FYH-MENS IN FYH-VARI.
           MOVE SPACES TO FYH-MEN2 IN FYH-MENS.
           MOVE LOW-VALUE TO FYH-CMMA IN FYH-VARI.
           MOVE LOW-VALUE TO FYH-GLS-RSPT IN FYH-CMMA.
           MOVE LOW-VALUE TO FYH-FEC-FHOY IN FYH-GLS-RSPT.
           MOVE 0 TO FYH-NUM-SHOY IN FYH-FEC-FHOY.
           MOVE 0 TO FYH-NUM-AHOY IN FYH-FEC-FHOY.
           MOVE 0 TO FYH-NUM-MHOY IN FYH-FEC-FHOY.
           MOVE 0 TO FYH-NUM-DHOY IN FYH-FEC-FHOY.
           MOVE LOW-VALUE TO FYH-HRA-HHOY IN FYH-GLS-RSPT.
           MOVE 0 TO FYH-NUM-HHHY IN FYH-HRA-HHOY.
           MOVE 0 TO FYH-NUM-MMHY IN FYH-HRA-HHOY.
           MOVE 0 TO FYH-NUM-SSHY IN FYH-HRA-HHOY.
           MOVE 0 TO FYH-NUM-JULI IN FYH-GLS-RSPT.
           MOVE 1 TO SYS-GET-DATE IN SYS-CTTS.
           MOVE 2 TO SYS-GET-TIME IN SYS-CTTS.
           MOVE 3 TO SYS-RTRN IN SYS-CTTS.
           MOVE 4 TO SYS-XCTL IN SYS-CTTS.
           MOVE 5 TO SYS-LINK IN SYS-CTTS.
           MOVE 6 TO SYS-ABOR IN SYS-CTTS.
           MOVE '000031060091121152182213244274305335' TO SYS-VACU IN
           SYS-CTTS.
           MOVE LOW-VALUE TO HOY-STP-ITRN IN HOY-VARI.
           MOVE LOW-VALUE TO HOY-FHOY IN HOY-STP-ITRN.
           MOVE 0 TO HOY-SHOY IN HOY-FHOY.
           MOVE 0 TO HOY-AHOY IN HOY-FHOY.
           MOVE 0 TO HOY-MHOY IN HOY-FHOY.
           MOVE 0 TO HOY-DHOY IN HOY-FHOY.
           MOVE 0 TO HOY-HHOY IN HOY-STP-ITRN.
           MOVE ' ' TO PGM-ICLR IN PGM-VARI.
           MOVE ' ' TO PGM-LIMPIAR-TODO IN PGM-VARI.
           MOVE 'K' TO PGM-LIMPIAR-LLAVES IN PGM-VARI.
           MOVE 'F' TO PGM-LIMPIAR-CAMPOS IN PGM-VARI.
           MOVE 'N' TO PGM-NO-LIMPIAR-NADA IN PGM-VARI.
           MOVE SPACES TO PGM-PROG IN PGM-VARI.
           MOVE SPACES TO PGM-NTRN IN PGM-VARI.
           MOVE LOW-VALUE TO PGM-STAT IN PGM-VARI.
           MOVE LOW-VALUE TO PGM-STAT-CIC IN PGM-STAT.
           MOVE '2' TO PGM-STT1-CIC IN PGM-STAT-CIC.
           MOVE '3' TO PGM-STT2-CIC IN PGM-STAT-CIC.
           MOVE '23' TO PGM-SRNF IN PGM-VARI.
           MOVE '00' TO PGM-SOKS IN PGM-VARI.
           MOVE '  ' TO PGM-SNUL IN PGM-VARI.
           MOVE SPACES TO PGM-SUAR IN PGM-VARI.

       FIN-GNS-PRO-LIMPIAR-VARIABLES.
           EXIT.
